{"type":"HOSTEL","name":"Wake Up! Sydney Central","nameEN":"Wake Up! Sydney Central","isActive":true,"isNew":false,"description":"Ready to discover Australia’s best accommodation experience?\r\n\r\nVoted ‘Best Hostel in Australia' & 'Best Extra-Large Hostel Oceania' at the 2025 Hostelworld HOSCARs, a stay with Wake Up! Sydney Central sets you up for a next-level travel experience.\r\n\r\nWake Up! Sydney is where you can easily make friends from around the world, explore the best of Sydney from your doorstep, revel in nights of partying, and choose the way you want to travel. All while having the best quality bed to sleep in at the end of each day.\r\n\r\nTo curate your own unforgettable adventure in Sydney, take your pick from Wake Up’s perks and benefits:\r\n• Complimentary wine & cheese night\r\n• Guided group walking tours (including Bondi Beach, Sydney City and Manly Beach)\r\n• Social meetups and complimentary bar tabs\r\n• Onsite travel desk, with discounts available across East Coast Australia\r\n• In-house cafe, bar and nightclub\r\n• Sydney pub crawls\r\n• 24-hour reception and check-in\r\n• Free WiFi, from anywhere in the hostel\r\n• Easy-to-use laundry facilities\r\n• Communal kitchen and dining area\r\n• Daily happy hour - 4pm to 9pm \r\n• Live DJs 7 nights a week\r\n• Daily social events, 7 days a week\r\n• In-house activities team to help you meet other travelers\r\n\r\nMAKE MATES FROM AROUND THE WORLD\r\nEasily fit into Wake Up’s social vibes and community energy, with all-inclusive activities 7 days a week. Take your pick from a range of guided walking tours and beach walks, to pub crawls, social meetups and themed parties. If you’re hoping to make friends from around the world, you’ve come to the right place.\r\n\r\nSTAY IN THE CENTRE OF SYDNEY\r\nWake Up Sydney is located in the heart of the city, which means the best of Sydney is right outside your doorstep. Sydney’s Central train station is located opposite the hostel, making for the most simple connection to the Airport, Bondi, Blue Mountains, South Coast and more. In addition, buses and trams are just footsteps away from the property, connecting you easily to the Opera House, Harbour Bridge, and Darling Harbour. Feel like walking? Great! Must-see suburbs like Surry Hills, Glebe and Hyde park are just a 10-15 minute walk away.\r\n\r\nAFFORDABILITY MEETS AWARD-WINNING QUALITY\r\nEvery room at Wake Up has been recently renovated with today’s traveler in mind. Quality Australia-made furnishings, superior cleanliness and modern amenities (hello bedside light boxes and charging points!) are just some of the details. Rest easy with individual lockers, key-only room access, linen and pillows provided, and a range of room options (including female-only dorms) to suit your budget and style.\r\n\r\nONSITE CAFE, BAR & NIGHTCLUB\r\nWake Up Sydney comes with a warning: you might never want to leave! The in-house facilities take the hostel to the next-level. Enjoy barista-made Colombian coffee, breakfast and lunch at Roy’s Cafe. As the sun goes down, sip your way through Happy Hour drink specials. When it’s time to get the party started, Wake Up’s onsite nightclub Side Bar has you covered, with live DJs, themed nights and trip-defining memories guaranteed.\r\n\r\nONSITE TRAVEL DESK\r\nWhether you want to organise a day trip to The Blue Mountains, an Aussie East Coast Adventure, or just about anything else, Wake Up’s onsite team of travel experts are there to help. Better still, guests can enjoy exclusive discounts on travel, tours and day trips not just in Sydney, but across Australia. In addition, Wake Up’s Travel Desk can assist you with Work & Travel. During their free Travel Talks (every Monday & Thursday), you can chat all about finding work, backpacker jobs, and tailoring your Australia trip to suit your vibe and budget. \r\n\r\nACTIVITY CALENDAR\r\nView Wake Up’s most up-to-date activity schedule at wakeup.com.au/sydney, or see below.\r\n\r\nMonday:\r\n• City Orientation Walking Tour - 10:45am\r\n• Travel Talk - Aussie Travel Presentation - 5pm\r\n• Pizza Night - 8pm\r\n• Musical Bingo - 8pm\r\n• Live DJs - from 9pm\r\n\r\nTuesday:\r\n• Trivia Night (with cash prizes) - 7pm\r\n• Live DJs - from 9pm\r\n\r\nWednesday:\r\n• Sydney Beaches Walking Tour - 10:45am\r\n• Free Wine & Cheese Night - 8pm\r\n• Free Drinks & Live DJs - 9pm\r\n\r\nThursday:\r\n• Travel Talk - Aussie Travel Presentation - 5pm\r\n• Alt Anthem Thursdays - from 8pm\r\n\r\nFriday:\r\n• City Orientation Walking Tour - 10:45am\r\n• Free Mexican Party w/ Sangria & Snacks - 8pm\r\n• Free Drink @ Side Bar - 9pm\r\n\r\nSaturday:\r\n• Manly Beach Day - 10.45am\r\n• Beer Pong Tournament (with cash prizes) - 8pm\r\n• Saturday Bar Shout - 9pm\r\n\r\nSunday:\r\n• Sunday Pub Crawl ($20)\r\n\r\nT&Cs\r\n• Guests must be 18+\r\n• All guests must provide a valid photo ID (international passport or driver’s license) at the time of check-in\r\n• The credit card used to make the booking must be presented upon check-in\r\n• Special conditions apply for bookings over Christmas & New Years\r\n• Please read the 'House Rules' prior to booking","hostelworldSays":"Wake Up! Sydney voted 'Best Extra-Large Hostel in Oceania' and 'Most Popular Hostel in Sydney' at the 2024 Hostelworld HOSCARs Awards and it's no wonder , it's no wonder Wake Up! Sydney is the go-to accommodation choice for travellers. We love the hostel's facilities, including its convenient location next to Central Station, a cafe, bar and nightclub, and an onsite travel desk to help you with your Aussie travel plans. Travellers tell us they also appreciate the \"very engaging community\", and staff who \"are super friendly and go out of their way to accommodate you\", hosting parties and events every day.","hostelSays":"I think what makes us different is that we offer an experience, not just a bed. We add value to your room rate by offering free daily activities, including a city orientation tour twice a week, a beach walk, football outings and more. On check-in you'll receive lots of vouchers with discounts, including a free beer in our bar and free coffee in the café. In fact, we've got everything all under one roof: whether you want to do your laundry, get online, watch TV in our common areas, connect to Wi-Fi, prepare your own food, withdraw cash, book a tour, have a beer, coffee or a cheap meal, Wake Up is fully equipped to serve you! \r\nWe offer easy access to all of Sydney's main attractions. I recommend taking the short bus ride to the Opera House and Harbour Bridge, or over to Bondi Beach.\r\nWe cater mainly to 18-30-year-old travellers on a budget but all adults are welcome and we do cater for people with special needs or disabilities. Unfortunately, we don't have facilities suitable for children.","location":{"address1":"509 Pitt Street","address2":"Opposite Central Railway","city":{"id":81,"name":"Sydney","nameEN":"Sydney"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":77,"name":"New South Wales","nameEN":"New South Wales"},"latitude":"-33.8823787","longitude":"151.2046676","distance":{"kilometers":1.71,"miles":1.06}},"maxGuestsPerBooking":10,"depositPercentage":15,"ratings":{"security":97,"location":96,"staff":95,"atmosphere":92,"clean":92,"facilities":91,"value":91,"overall":93,"ratingsCount":10787},"groupInformation":null,"currency":"AUD","houseRules":{"notes":"Wake Up! Sydney - House Rules\r\n\r\n•\tArrivals & Departures\r\n- Check-In is from 2pm daily. Guests arriving prior to this time may leave their luggage at the hostel and we will do our best to get you in as soon as we can. \r\n- Departing guests must remove all their belongings from their room, and check out, by 10am. At this time, all possessions must be removed from the dorm/room. \r\n- We provide complementary luggage storage for your day of arrival and departure only. \r\n\r\n•\tCheck-in\r\n- A valid form of photo identification is to be presented upon check-in, in the form of an International Passport, National ID Card or Drivers License. Failure to provide acceptable ID will mean that you cannot check in.\r\n- Accommodation must be paid in full upon arrival (if not prior). \r\n- After check-in your tariff is non-refundable if your stay is cut short.\r\n- Management reserves the right to cancel any booking not paid for in full upon check-in.\r\n\r\n•\tCheck Out \r\n- Check out is at 10am. If you check out late, you will be asked to pay for an extra night, so make sure you’re up and ready in time!\r\n\r\n\r\n•\tPayments & Credit Card Transactions\r\n- The credit card used to make a reservation must be presented upon check-in and the cardholder must be present. We are not able to charge a credit card on file and any pre-payments must be organised with the Wake Up! Management team well in advance. \r\n- To cover our banking transaction fees, a surcharge of 2% will applied to all card transactions, including contactless transactions\r\n\r\n•\tRoom allocations\r\n- For last minute, multiple person reservations (in periods of high demand) it may not be possible to put all occupants in the same room. We shall certainly do our best though!\r\n- For last minute reservations (in periods of high demand) please be aware that you may need to move rooms mid stay.\r\n- We do not assign bed numbers and as such cannot guarantee bottom or top bunk beds in rooms. Best to book a private room if this is a requirement for you. \r\n\r\n•\tRoom Key Cards \r\n- Upon Check-in each guest must pay a $20 key deposit and will be required to keep their key card on your person at all times. This key card gives you access to the hostel, elevators and room. Staff may ask to see your key card when entering the hostel and if you lose your key card, we charge $20 for a replacement.\r\n\r\n•\tAge Restrictions\r\n- We are strictly an 18+ hostel and bookings cannot be accepted for any person under the age of 18. Unlike some hostels we do not have an upper age limit. Most of our guests are backpackers in the 18 to 30 age range. Please be aware that you may be in a top bunk.\r\n\r\n•\t24-hour Cancellation policy and No-Shows\r\n- Wake Up has a 24-hour cancellation period. If you let us know on the day of arrival, or fail to show up on the arrival date, you will incur a cancellation charge equal to one nights accommodation. If you arrive a day late without informing the hostel, we will try and find you a bed, but this may not be in the same room type booked and may incur extra charges. \r\n\r\n•\tGuest Behaviour \r\n- The comfort, safety and security of our guests is of paramount importance to us at Wake Up! Sydney. Any guest(s) who, in the opinion of our staff, compromise the comfort, safety or security of other guests, staff or local residents will be requested to leave the hostel premises and will not be offered a refund. Guests are expected to respect other guests, staff, local residents and property. \r\n- In the case of groups, the group leaders must ensure that all members of their group behave in an acceptable manor. Failure of any individual group member to do so will result in the expulsion of the whole group.\r\n\r\n•\tNo Smoking / Vaping \r\n- Smoking & Vaping is not permitted anywhere in the Wake Up! Sydney building. Any guest found smoking or vaping in the building will be asked to leave the premises immediately and will not be offered a refund. In the event that the Fire Alarm is set off you will be liable for the $2500 call out fee. \r\n\r\n•\tFire Equipment (Regulations)\r\n- Tampering with Fire Equipment is a serious offence in Australia. Any guest found tampering with detectors, alarms or fire extinguishers will be liable for any fines and/or repairs as a result of the offence. In addition to this you will be asked to leave the premises immediately and will not be offered a refund. In the event that the fire alarm is set off you will be liable for a $2500 call out fee. \r\n\r\n•\tNo Drugs – Including NOS Canisters (Nangs)\r\n- Drug use is illegal in Australia. Any guest found using drugs within the building will be asked to leave the premises immediately and will not be offered a refund.\r\n- Use of NOS Canisters (Nangs) will result in your eviction from our property. \r\n\r\n•\tAlcohol consumption \r\n- Alcohol consumption in the hostel is permitted in the 1st floor common area between 2pm & 10pm only. Alcohol must not be kept or consumed in the room at any time. Any alcohol found in the rooms will be confiscated and returned upon checkout. Alcohol is available in Side Bar during its hours of operation. Due to the nature of the liquor license no alcohol purchased in Side Bar can be consumed outside of Side Bar.\r\n\r\n•\tPersonal Property \r\n- Secure lockers for laptops and small valuable items are located in each dorm room. It is the guest's responsibility to ensure that their personal belongings are secure at all times. Wake Up accept no liability for the loss, theft or damage to guests’ property, however sustained or caused. We strongly recommend you bring a padlock to use with your luggage & backpack.\r\n\r\n•\tDamage to Wake Up Property \r\n- Guests will be expected to reimburse Wake Up for any damage caused by inappropriate behaviour during their stay.\r\n\r\n•\tLiability \r\n- Except in relation to death or personal injury caused by our negligence, Wake Up's liability remains, at all times, limited to the value of the services booked, excluding any amendment charges paid to us.\r\n\r\n•\tYour Information \r\n- Wake Up shall only store and use information you supply to us or which is supplied to us for the purposes of carrying out our contract with you, and to inform you of other services and offers which we make available from time to time. If you do not wish to receive such information, please let us know by emailing us at: bookup@wakeup.com.au or by writing to us at 509 Pitt Street, Sydney, NSW, 2000.\r\n\r\n•\tErrors and Omissions\r\n- Any omission or error in sales literature, web pages or site, order form, quotation, price list, order acknowledgement, dispatch note, invoice or other documents issued by us may be corrected by us without liability. We will advise you of any changes at the time of booking or as soon as is reasonably possible thereafter.\r\n\r\n•\tDiscretion \r\n- All bookings are subject to availability and Wake Up reserves the right to decline any booking at its discretion.\r\n\r\n•\tChristmas & New Years – Special Conditions\r\n- All reservations between 23/12 - 04/01 (inclusive) are Non Refundable. This includes both the 'Standard' & 'Non-Refundable' rate plans. \r\n- Standard Rate Plan - Minimum 4 Night Stay - Higher Price\r\n- Non-Refundable Rate Plan - Minimum 7 Night Stay - Lower Price\r\n- Reservations must be paid at the time of booking using the credit card that you nominated on your reservation. If the credit card you nominated is not chargeable, you will be contacted by management. Failure to provide a chargeable credit card may result in your booking being cancelled.","checkin":{"from":14,"until":23},"latestCheckout":"10:00","policies":["TAXESINCLUDED"],"cancellationPolicy":{"canxDays":1,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[{"year":2025,"other":"Oceania","place":1,"otherLabel":"Continent","key":"HOSCARCONTINENTWINNER","priority":8},{"year":2025,"other":"Australia","place":1,"otherLabel":"Country","key":"HOSCARCOUNTRYWINNER","priority":9},{"year":2025,"other":"Oceania","place":1,"otherLabel":"","key":"HOSCARBESTCHAIN","priority":18},{"year":2025,"other":"Oceania","place":1,"otherLabel":"Continent","key":"BESTXLARGEHOSTELC","priority":255},{"year":2024,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2024,"other":"Oceania","place":1,"otherLabel":"","key":"HOSCARBESTCHAIN","priority":18},{"year":2024,"other":"Oceania","place":1,"otherLabel":"Continent","key":"BESTXLARGEHOSTELC","priority":255},{"year":2020,"other":"","place":5,"otherLabel":"","key":"HOSCARWORLDWIDEWINNERXL","priority":2},{"year":2020,"other":"Australia","place":1,"otherLabel":"Country","key":"HOSCARCOUNTRYWINNER","priority":9},{"year":2019,"other":"","place":7,"otherLabel":"","key":"HOSCARWORLDWIDEWINNERXL","priority":2},{"year":2019,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2018,"other":"","place":6,"otherLabel":"","key":"HOSCARWORLDWIDEWINNERXL","priority":2},{"year":2018,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2017,"other":"","place":3,"otherLabel":"","key":"HOSCARWORLDWIDEWINNERXL","priority":2},{"year":2017,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2016,"other":"","place":5,"otherLabel":"","key":"HOSCARWORLDWIDEWINNERXL","priority":2},{"year":2016,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2012,"other":"Sydney","place":1,"otherLabel":"City","key":"HOSCARMOSTPOPULAR","priority":10},{"year":2010,"other":"","place":2,"otherLabel":"","key":"HOSCARBESTLARGE","priority":7},{"year":2006,"other":"","place":0,"otherLabel":"","key":"HOSCARBESTLARGE","priority":7},{"year":2006,"other":"Oceania","place":1,"otherLabel":"Continent","key":"HOSCARCONTINENTWINNER","priority":8}],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":80,"name":"FREECITYMAPS"},{"id":90,"name":"FREEWIFI"},{"id":103,"name":"FREEINTERNETACCESS"},{"id":140,"name":"FREECITYTOUR"},{"id":351,"name":"FREELUGGAGESTORAGE"}]},{"name":"FACILITYCATEGORYGENERAL","id":2,"facilities":[{"id":356,"name":"COWORKINGSPACE"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":15,"name":"LUGGAGESTORAGE"},{"id":20,"name":"24HOURRECEPTION"},{"id":21,"name":"TOURSTRAVELDESK"},{"id":77,"name":"ATM"},{"id":104,"name":"POSTALSERVICE"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":4,"name":"INTERNETACCESS"},{"id":41,"name":"NIGHTCLUB"},{"id":79,"name":"BOOKEXCHANGE"},{"id":95,"name":"BOARDGAMES"},{"id":133,"name":"WIFI"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":2,"name":"RESTAURANT"},{"id":12,"name":"BAR"},{"id":83,"name":"MEALSAVAILABLE"},{"id":86,"name":"VENDINGMACHINES"},{"id":117,"name":"CAFE"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":92,"name":"KITCHEN"},{"id":99,"name":"COOKER"},{"id":100,"name":"FRIDGEFREEZER"},{"id":101,"name":"UTENSILS"},{"id":124,"name":"MICROWAVE"},{"id":359,"name":"KETTLE"},{"id":360,"name":"POTSANDPANS"},{"id":361,"name":"SINK"},{"id":362,"name":"STOVE"},{"id":363,"name":"TOASTER"}]},{"name":"FACILITYCATEGORYACCESSIBILITY","id":7,"facilities":[{"id":8,"name":"WHEELCHAIRACCESSIBLE"},{"id":27,"name":"ELEVATOR"},{"id":364,"name":"RAMPS"},{"id":366,"name":"WHEELCHAIRACCESSIBLEBATHROOMS"}]},{"name":"FACILITYCATEGORYLAUNDRY","id":8,"facilities":[{"id":5,"name":"LAUNDRYFACILITIES"},{"id":102,"name":"DRYER"},{"id":122,"name":"IRONIRONINGBOARD"},{"id":131,"name":"WASHINGMACHINE"},{"id":368,"name":"FREEIRONIRONINGBOARD"},{"id":369,"name":"RECYCLINGBINS"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":14,"name":"LOCKERS"},{"id":22,"name":"KEYCARDACCESS"},{"id":112,"name":"24HOURSECURITY"},{"id":375,"name":"CCTVINCOMMONAREAS"},{"id":376,"name":"FIREEXTINGUISHERS"},{"id":377,"name":"FIRSTAIDKITS"},{"id":378,"name":"SMOKEALARMS"},{"id":379,"name":"SMOKEDETECTOR"}]},{"name":"FACILITYCATEGORYSOCIALAREAS","id":12,"facilities":[{"id":24,"name":"COMMONROOM"},{"id":380,"name":"LOUNGEROOM"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":50,"name":"AIRCONDITIONING"},{"id":111,"name":"READINGLIGHT"},{"id":382,"name":"CHARGINGPLUGS"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":13,"name":"TOWELSFORHIRE"},{"id":37,"name":"BREAKFASTNOTINCLUDED"},{"id":115,"name":"HAIRDRYERSFORHIRE"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/gfp4n4okjujojxzkl81c","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/undjfsx7ziywjdbkgtzi","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/j23cv4b29xztiv5c4o2l","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/puvxcpiwe9o3fqdi0sry","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/m6smxsdqrrm6be6gmsof","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/gtcjgvf6blqeab8itmgg","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/wjonkb6mutrphvl0f2fw","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/fq84df9zdcfcc14wdls4","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/pnnmgqhjv2ydhsfc4aqt","position":9},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/mdkgoky3ab1erocethxt","position":10},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/g926uyueqg5zn5yaoogm","position":11},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/zywvveapmplm2qgnv9dv","position":12},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/tthj9vbxt9urlv6nddww","position":13},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/mae0qbfyezhyzdq1axy8","position":14},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/cumwpvh3vcnt8mlfswel","position":15},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/wg8mkt3sfjcxfphkbvos","position":16},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/siepbswr9okvml9mezy6","position":17},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/nwez04tacfwoje9wai6q","position":18},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/flyummm7pnstlfyhpgde","position":19},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/dypk6wvtxojmjorpekjf","position":20},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/juiostfae0mcdnfmeveo","position":21},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/trsv3jygf1bvx6sjesuj","position":22},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/ymgiqzy0yfkd4wcdpoty","position":23},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/b5lr7zr7x1msp2gfabea","position":24},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/v9gnap3vva8wpkmq2xny","position":25},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/ywyrr1sfsvsmz2gmoscm","position":26},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/bmwpn7d6kh2odcvvahdj","position":27},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/pemzbaq5qrvyjdmef8jo","position":28},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/wo0uf01zzhfq2x1i4eac","position":29},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/1/1704/k3n5p9ncpb8fqgfldhsd","position":30}],"videos":[{"id":78768,"url":"https://www.youtube.com/embed/eXUklTU76Mw","still":"https://img.youtube.com/vi/eXUklTU76Mw/0.jpg"}],"video":"https://www.youtube.com/embed/eXUklTU76Mw","payments":{"payNow":false},"paymentMethods":["Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":true,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":49,"promotions":[{"id":211724,"type":"MOBILE","stack":true,"name":"MOBILEPROMOTION","created":"2024-12-23T21:44:03","isActive":true,"conditions":{"stayDates":{"isAfterOrSameDayThan":"2025-04-30","isBeforeOrSameDayThan":"2026-04-30","isNotOneDayOf":["2025-08-31","2025-12-24","2025-12-25","2025-12-28","2025-12-29","2025-12-30","2025-12-31","2026-01-01","2026-01-04","2026-01-05","2026-01-06","2026-01-07","2026-01-08","2026-01-11","2026-01-12","2026-01-13","2026-01-14","2026-01-15","2026-01-18","2026-01-19","2026-01-20","2026-01-21","2026-01-22","2026-01-25","2026-01-26","2026-01-27","2026-01-28","2026-01-29"],"isTotalNightsGreaterOrEqualThan":1,"isDayOfWeekOneOf":["Monday","Tuesday","Wednesday","Thursday","Sunday"]},"propertyIds":{"containsAnyOf":[1704]},"ratePlanTypes":{"containsAnyStringOf":["Standard","Standard_BB","NRR_BB"]},"channel":{"isOneStringOf":["APPS","HW_MOBILE"]}},"benefits":{"PERCENTDISCOUNT":{"value":10}}}],"categories":[{"group_category_id":"STAIRCASE_TO_SUSTAINABILITY","group_category_type":"sustainability","group_category_title":"Staircase to Sustainability","group_category_description":"STAIRCASE_TO_SUSTAINABILITY_DESCRIPTION","categories":[{"category_title":"Sustainability Level 1","category_description":"This hostel has begun to introduce practices that result in a positive social and environmental impact, grasping the fundamentals of the Staircase to Sustainability.","category_image":"","category_id":"SUSTAINABILITY_TIER_1","lastModified":"2024-07-31T08:12:51.838Z"}],"multiple_categories":false}]}
