{"type":"HOSTEL","name":"Bondi Beach Backpackers","nameEN":"Bondi Beach Backpackers","isActive":true,"isNew":false,"description":"Bondi Beach Backpackers has the highest Google rating of all the places in Bondi Beach.\r\n\r\nBondi Beach Backpackers is open for business and providing great service as usual. We are SMALLER and SAFER! Bondi Beach Backpackers is perfectly located seconds from the Bondi Beach, surrounded by cool bars and cafés just 20 minutes from the City & Airport. \r\n\r\nAll rooms are air conditioned for the summer months, clean, safe, modern & fun with small medium and large mixed and females share rooms plus double rooms, twin rooms, triple rooms & family rooms. \r\n\r\nOur friendly office staff can help you with airport shuttles, tax file number, bank accounts, FREE! sim cards, power adaptors plus any kind of travel ideas both local & interstate & can make bookings too. We can help you get a job too with FREE! employment help including tax files numbers, bank accounts training courses. We also have FREE! Sydney guides, FREE! one day road trip guides and FREE! interstate road trip guides to enhance your Sydney Experience. We really look forward to making your stay a great one!\r\n\r\nIncludes tea & coffee + rice & pasta + surfboards & body boards, skateboards, snorkels & masks, table tennis, even sun cream is included. \r\n\r\nWe look forward to seeing you at Bondi Beach Backpackers soon. Safe travels.\r\n\r\nKindest Regards\r\n                                                              \r\nThe Bondi Beach Backpackers Team.","hostelworldSays":null,"hostelSays":null,"location":{"address1":"35a Hall St","address2":"Bondi Beach","city":{"id":81,"name":"Sydney","nameEN":"Sydney"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":77,"name":"New South Wales","nameEN":"New South Wales"},"latitude":"-33.8903337","longitude":"151.2729059","distance":{"kilometers":6.59,"miles":4.1}},"maxGuestsPerBooking":10,"depositPercentage":15,"ratings":{"security":81,"location":94,"staff":82,"atmosphere":80,"clean":81,"facilities":79,"value":81,"overall":83,"ratingsCount":1262},"groupInformation":null,"currency":"AUD","houseRules":{"notes":"Hello to you,\r\n\r\nNEED TO KNOW INFORMATION: Please can you provide us with some more information to info@bondibeachbackpackers.com.au\r\n\r\n1. Please let us know the first name/family name & genders of all the guests on the reservation. Example: Benjamin Boone/male & Billy Eilish/female. This allows us to often upgrade you or get friends together.\r\n\r\n2. Please let us know, if not already provided, your International or Australian mobile number. Example: +44 7123 123 456 or 0419 123 456\r\n\r\n3. Please let us know your arrival time. Options are: Before 8am, 8am to 1pm, 1pm to 5pm, 5pm to 8pm, 8pm to 10pm, after 10pm. We are not 24 hours reception so this information is crucial to making your arrival and check in easy.\r\n\r\n4. Please let us know if you have any friends already staying or friends who are separate reservations. This allows us to get you together.\r\n\r\nWe look forward to your email.\r\n\r\nLET'S BE REALLY CLEAR OF WHAT WE ARE: We are not a hotel, a motel or a bed & breakfast and not boutique. We are a backpacker’s accommodation. We are a family business established for over 29 years with a price structure that fits our accommodation level. We are a professional business with high standards with thousands upon thousands of happy customers who return over & over.\r\n\r\nOur client base is young travellers; average age is 18 to 35 and occasionally higher, we also have many families stay in the winter months. We have a firm but fair set of rules in place for our guests and we don’t allow our guests to have free reign at the expense of other guests. We have an on-site live-in manager. We accept backpackers and travellers and regularly have older guests and families most of whom are very happy with our rooms and service. For the amount of money involved if you expect 5-star hotel style rooms you won’t find them in a backpacker’s hostel. We allow our guests to drink their own alcohol onsite with same rules as bars and pubs. We do not allow any drugs at any time and are very firm with those who flaunt it. If you expect absolute quiet, please do not book as it’s hard to guarantee. We suggest you call us before booking to have a conversation with us if you are unsure and want clarification as we don’t want to mislead you as to what we are and what we have to offer you.\r\n\r\nCARD DECLINED/INSUFFICIENT FUNDS: Your reservation is either a pay now/non-refundable reservation or a refundable reservation. \r\n\r\nFOR A PAY NOW/NON REFUNDABLE RESERVATION, Please ensure you have the funds on your credit/debit card used to make the reservation to cover the balance due plus 2% credit/debit card fee. You risk losing the reservation if your card declines or has insufficient funds. Bondi Beach Backpackers is unable to refund or reimburse you your 15% deposit already paid in this situation. Regular rates will be charged if this occurs, so you have something when you arrive. \r\n\r\nFOR A REFUNDABLE RESERVATION, Please ensure you have the funds on your credit/debit card used to make the reservation to cover the balance due plus 2% credit/debit card fee. This will charged the day before you arrive. You risk losing the reservation if your card declines or has insufficient funds. Bondi Beach Backpackers is unable to refund or reimburse you your 15% deposit already paid in this situation. Regular rates will be charged if this occurs, so you have something when you arrive. \r\nDEBIT/CREDIT CARDS THAT CANNOT BE PRESENTED AT CHECK IN: We require a signature from the card owner and to see the debit/credit card used to make the booking. If the card owner is not present at check in, we have no choice but to ask the guest to pay for the stay and bond/security deposit. We will then refund the card owner who is not present. Please use your own debit/credit card to make the booking.\r\n\r\nMOBILE NUMBERS: We cannot recommend enough that you place your mobile number (international or Australian) on your booking. It allows us to solve issues quick and easy. If you have already booked then please email us all the full names on the booking, plus genders plus mobile numbers. Giving us the chance to call you is invaluable.\r\n\r\nARRIVALS: We will be expecting you on the arrival date you requested, if you have not shown up by 8am on the NEXT DAY we will assume you are not coming at all and your whole booking will be considered cancelled. We don't do refunds of any kind or credit you days for future nights. Please communicate with us if you intend to arrive later. \r\n\r\nARRIVAL TIME, GENDERS, FRIENDS: Please email us your arrival time. Please also email us your genders. Sometimes we cannot tell if your name is for a male or female person. We often upgrade female(s) to female rooms if mixed rooms are majority male. The information you provide helps us help you. If you are 2 guests or more email us the names and genders and mobile numbers. If you have friends in the building or travelling with another reservation, email us so we can try get you together. Basically, help us help you.\r\n\r\nROOM CHOICE: On your behalf, we will choose “together” or “not moving” over room choice. For example if you are 2 ,3 or more guests and you have booked an 8 share. Rather than split you across 2 or 3 rooms to satisfy room choice we will place you together in a larger room. Similarly, if we have to move you around to satisfy room choice, we will place you in a larger room with no moving.\r\n\r\nMALES BOOKING FEMALE ONLY ROOMS: Males who book female only dorms (by mistake or on purpose) will be charged in full for the female dorm you have booked and charged again for the male or mixed equivalent dorm or next best available dorm. \r\n\r\nOFFICE HOURS: We are a small family run backpacker's hostel that does not have 24-hour reception. We open at 8am and close at 10pm. If you arrive from 8am to 1pm, we will be here to meet you, greet you and check you in personally. If you arrive between 1pm and 5pm, we will check you in remotely, which is quick and easy. Rooms will be ready, and keys will be in key safes.  If you arrive from 5pm to 8pm, we will be here to meet you, greet you and check you in personally. If you arrive from 8pm to 10pm we have staff here who can help you. Arriving after 10pm: YOU ARE REQUIRED to communicate with us at a time where we can respond to your late arrival time. A phone call is best BEFORE 8PM to make sure we can leave key out for you and more importantly that you know what to do and where to find it. You need to call before 8pm so we can prepare for you, the more notice you give the better.\r\n\r\nBOND/SECURITY DEPOSIT: We ask for a Bond/Security Deposit from each guest. The amount is $100 per guest. We debit this from the credit/debit card on the reservation plus 2% credit/debit card fee on the morning of your arrival or the night before. Bondi Beach Backpackers has a minimum fee of $2 per person per night that we charge each guest from the $100 security deposit required at check in. This will be explained again and in detail at check in. This allows us to offer services that other places charge for. This would include tea, coffee, sugar, rice and pasta included in your stay. This would also include use of surfboards, body boards, skateboards, snorkels and masks and table tennis included in your stay. This would also include our washing up service where we wash all plates, bowls, mugs, glasses and cutlery. We find this to be most helpful as most people don't like washing their dishes, so we do it for you which keeps the whole place cleaner which makes your stay better. This also includes employment help other places charge for such as free sim cards for mobiles phones, Tax file number, Medicare card, Help with bank accounts, training courses such as RSA & White card. This also includes a very popular CV/Resume tweaking service where we can review your current CV/Resume and tweak it to Australian standards. This also includes our extensive range of travel guides for local sightseeing with public transport and in your own car with one day road trip guides as well as interstate road trip guides for the entire country which will improve your experience and save you money by giving you more value for your time. This also includes a heap of vouchers giving discounts for local places to eat, local tattoo places, local tourist attractions. We also have a fabulous snorkelling guide as the snorkelling here is FABULOUS.\r\n\r\nBOOKINGS FOR TODAY OR TOMORROW: Bookings made on the day of arrival or the day before arrival may not get the exact room requested. You will be given the next best room available. \r\n\r\nEARLY DEPARTURES: If you leave Bondi Beach Backpackers before your specified departure date we cannot give a refund on any payments. We are also unable to credit nights or transfer nights to other guests.\r\n\r\nDAMAGES: Bondi Beach Backpackers cannot be responsible for any items lost or stolen during my stay. Guests must take responsibility for all damages within Bondi Beach Backpackers including my room & its contents caused by myself or those with me or those I invite in. \r\n\r\nCHECK OUT TIME & CHECK OUT POLICIES: Guests should know that check out time is 10am (charges apply if I check out after 10:30am) & that Bondi Beach Backpackers does not give refunds, breakups or transfers.\r\n\r\nNOISE POLICY: Guests should understand that Bondi Beach Backpackers has a no noise policy 10pm to 10am. Failure will result in loss of deposit & I may be asked to leave without a refund. Please understand guests need sleep to go to work the next day\r\n\r\nSMOKING POLICY: Guests should understand that smoking anywhere inside will result in losing my security deposit instantly & it will have to be repaid. Guests who prepare or smoke or snort dope or other drugs must leave without a refund of any kind. Please don't do this anywhere on site. please go to the beach\r\n\r\nFIRE ALARM CALL OUT FEE: Guests should understand that the fire alarm call out charge is $2000.00 +2% card fee split between the number of guests in the room if no one owns up. Please don't smoke in the room as this will activate the alarm. Please use deodorant/hair sprays and hair dryers/straighteners in the bathrooms.\r\n\r\nVOMIT/PEE: Guests who vomit or piss anywhere except the toilet bowl will be charged $300.00 for cleaning plus $100.00 per mattress plus costs to clean other guest’s items or cost to replace other guests items. We don't care how drunk you are or what the excuse is. It's disgusting. It affects other guests and staff. It's expensive. Please don't do it!\r\n\r\nSOMETHING NOT RIGHT: A share room is exactly what it is, a share room. You are sharing a room with people you don't know. Sometimes the actions of others can upset you. In this case you have 3 choices, the first is to be upset but say or do nothing. Our staff cannot help you in this situation. Second, say something to the guest that is upsetting you, explain their behaviour is not acceptable, be firm but fair. Third, inform our staff. If it is urgent or an emergency, please call the office number 02 9365 4900 anytime night or day and we can fix straightaway. If not urgent, come to reception 8am to 1pm or 5pm to 8pm and will address it on your behalf. Please understand we can only fix something we know about. We want you to have a good experience and we are here to help you, we want you to be happy. Telling us at check out or after you have left is not good as the issue cannot be fixed or the person who has upset you has left. We need to know as soon as possible.\r\n\r\nDEBIT/CREDIT CARD FEES: We charge 2% credit/debit card fee on all transactions. \r\n\r\nCOMMUNICATION SOLVES ALL PROBLEMS: We cannot stress enough that communication solves all problems. Emails are good if done in advance, calling is always best 8am to 10pm. Please DO NOT CALL 10pm to 7am. Please Google 'TIME IN SYDNEY' before you call. We take calls 7am to 10pm. \r\n\r\nFINALLY, we want you enjoy your stay here at Bondi Beach Backpackers, were firm but fair and all conditions are there to keep you safe, the building safe, modern, clean, hygienic and most off all a fun and a great place to be, live, stay and enjoy. We can’t wait to meet you and smother you in information to make your experience better.\r\n\r\nTeam @ Bondi Beach Backpackers","checkin":{"from":12,"until":22},"latestCheckout":"10:00","policies":["NOCURFEW","TAXESINCLUDED"],"cancellationPolicy":{"canxDays":1,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":30,"name":"FREEPARKING"},{"id":80,"name":"FREECITYMAPS"},{"id":90,"name":"FREEWIFI"},{"id":103,"name":"FREEINTERNETACCESS"}]},{"name":"FACILITYCATEGORYGENERAL","id":2,"facilities":[{"id":28,"name":"BICYCLEPARKING"},{"id":51,"name":"MEETINGROOM"},{"id":78,"name":"ADAPTORS"},{"id":113,"name":"JOBSBOARD"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":6,"name":"AIRPORTTRANSFERS"},{"id":15,"name":"LUGGAGESTORAGE"},{"id":21,"name":"TOURSTRAVELDESK"},{"id":97,"name":"SHUTTLEBUS"},{"id":104,"name":"POSTALSERVICE"},{"id":116,"name":"PARKING"},{"id":121,"name":"HOUSEKEEPING"},{"id":129,"name":"CARDPHONES"},{"id":151,"name":"INTERNETCAF"},{"id":153,"name":"RECEPTIONLIMITEDHOURS"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":4,"name":"INTERNETACCESS"},{"id":79,"name":"BOOKEXCHANGE"},{"id":84,"name":"PLAYSTATION"},{"id":94,"name":"DVDS"},{"id":95,"name":"BOARDGAMES"},{"id":106,"name":"CABLETV"},{"id":133,"name":"WIFI"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":29,"name":"BBQ"},{"id":86,"name":"VENDINGMACHINES"},{"id":125,"name":"TEACOFFEEMAKINGFACILITIES"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":92,"name":"KITCHEN"},{"id":99,"name":"COOKER"},{"id":100,"name":"FRIDGEFREEZER"},{"id":101,"name":"UTENSILS"},{"id":124,"name":"MICROWAVE"}]},{"name":"FACILITYCATEGORYLAUNDRY","id":8,"facilities":[{"id":5,"name":"LAUNDRYFACILITIES"},{"id":102,"name":"DRYER"},{"id":122,"name":"IRONIRONINGBOARD"},{"id":131,"name":"WASHINGMACHINE"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"},{"id":145,"name":"STEAMROOM"}]},{"name":"FACILITYCATEGORYOUTDOORS","id":10,"facilities":[{"id":107,"name":"OUTDOORTERRACE"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":14,"name":"LOCKERS"},{"id":112,"name":"24HOURSECURITY"},{"id":123,"name":"SAFEDEPOSITBOX"}]},{"name":"FACILITYCATEGORYSOCIALAREAS","id":12,"facilities":[{"id":24,"name":"COMMONROOM"},{"id":108,"name":"GAMESROOM"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":50,"name":"AIRCONDITIONING"},{"id":87,"name":"TOWELSINCLUDED"},{"id":119,"name":"HAIRDRYERS"},{"id":120,"name":"CEILINGFAN"},{"id":132,"name":"TOWELSNOTINCLUDED"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":13,"name":"TOWELSFORHIRE"},{"id":37,"name":"BREAKFASTNOTINCLUDED"},{"id":82,"name":"LINENNOTINCLUDED"},{"id":115,"name":"HAIRDRYERSFORHIRE"},{"id":152,"name":"LATECHECKOUT"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/ehnvnxdbjx7m21rfixyp","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/pnzhefprgxk06plekcrt","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/vulqhh9rpz8efcqgtxpg","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/mmhmstbktbipipde376w","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/cu2uqb9nrru6fcckggop","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/ewzp7w89srljgnx0w9lz","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/azs24zu1evrflv53ct18","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/a6tj8j5cxchumkalqmif","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/259/xhxqwfmuzdreshhbxnay","position":9}],"videos":[{"id":38384,"url":"https://www.youtube.com/embed/pmUX933HQvI","still":"https://img.youtube.com/vi/pmUX933HQvI/0.jpg"}],"video":"https://www.youtube.com/embed/pmUX933HQvI","payments":{"payNow":false},"paymentMethods":["Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":3,"promotions":[],"categories":[]}
