{"type":"HOSTEL","name":"PodBed Sydney","nameEN":"PodBed Sydney","isActive":true,"isNew":false,"description":"PodBed Sydney is a friendly, clean and newly renovated backpackers hostel. Located at Potts Point, its location is perfect to get anywhere you like. 600 meters away to Kings Cross Station, one of the fastest ways to get into Sydney CBD, Bondi Junction, etc. In the area, you will find plenty of shops, restaurants and cafes. \n\nHouse Rules:\nRent is Due in Advance – Full payment is required to confirm your booking. No booking will be held without full payment.\nExtensions – If you'd like to extend your stay, please notify us at least 24 hours before your check-out time. No extensions will be allowed after 10:00 AM on your check-out day.\nDamage and Security Bond – By signing this form, you agree to allow management to charge for any documented damage caused during your stay. Upon check-in, we will pre-authorize a $50 security bond. If any damage exceeds this amount, you will be charged the full cost of repairs.\nKindness and Respect – Please treat our staff and fellow guests with kindness and respect. A positive attitude creates a better atmosphere for everyone!\nKitchen Hours – The kitchen closes at 10:00 PM. Please ensure you prepare your meals or late-night snacks before then.\nClean Up After Yourself – Wash your dishes and clean surfaces after use. A cleaning fee will be applied based on the time spent cleaning any mess left behind.\nLabel Your Food – Please label any food you store in the fridge with your name and checkout date. We conduct regular clean-outs to maintain freshness.\nNo Smoking Indoors – We’re a home, not a chimney. Smoking is strictly prohibited inside the building.\nNo Drugs or Controlled Substances – This includes balloons or any illicit substances.\nNo Alcohol on the Premises – Please enjoy the nearby bars, but refrain from bringing alcohol onto the property.\nRespect Quiet Hours – The backyard is off-limits after 9:00 PM, and loud noise or parties should be avoided after 10:00 PM. Many of our guests need to rest for work or early travel, so please keep noise to a minimum.\nNo Visitors After 10:00 PM – For the privacy and comfort of all, please do not invite visitors into your room or the property after this hour. Meet them outside or at their place.\n\nBehavior Conditions:\nAny behavior that does not align with these guidelines will be addressed at the discretion of the owner or manager, and you may be asked to leave. Please be considerate of others and avoid being \"that guest.\"\n\nImportant Note:\nCashless Accommodation – We do not handle cash on-site. Please ensure you provide a valid credit or debit card when booking.\nPre-Authorization – A pre-authorization will be placed on your card when you book or renew your stay. By confirming your reservation, you agree to follow these rules and accept responsibility for any damages caused to the property. If the house rules are not followed or damage occurs, charges will be applied directly to your card.\n\nBusiness Information:\nCleaning Hours:\n8:00 AM – 12:00 PM\n2:00 PM – 6:00 PM\n8:00 PM – 12:00 AM\nOffice Hours:\n2:00 PM – 6:00 PM Daily\n\nAfter-Hour Assistance:\nIn case you require assistance after hours, please do not email or use third-party chats. Instead, reach us directly by texting or calling our office number +61 426 661 985, or by buzzing the doorbell. Our night staff are on-site and will be glad to assist you.\n\n\nThank you for choosing us! We hope you have a wonderful stay and enjoy your time with us!","hostelworldSays":null,"hostelSays":null,"location":{"address1":"87 Macleay Street, Sydney Australia","address2":"","city":{"id":81,"name":"Sydney","nameEN":"Sydney"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":77,"name":"New South Wales","nameEN":"New South Wales"},"latitude":"-33.8710567","longitude":"151.2249111","distance":{"kilometers":1.7,"miles":1.06}},"maxGuestsPerBooking":8,"depositPercentage":15,"ratings":{"security":40,"location":60,"staff":60,"atmosphere":40,"clean":20,"facilities":30,"value":40,"overall":41,"ratingsCount":52},"groupInformation":null,"currency":"AUD","houseRules":{"notes":"Policies\r\n \r\nFor all dorm rooms, the max age for guests is 35.\r\n\r\nCheck-In: 14:00\r\nCheck-Out: 10:00 strictly, fee apply for any check out after 10 am\r\n \r\nCancellation Policies:\r\nCancellations for standard rate bookings can be cancelled up to 24 hours before check in time.  For bookings that are no shows- the property reserves the right to charge up to one nights stay.\r\n\r\nAny accommodation paid for inadvance will not be refunded if you not arrive at the accommodation or if youleave early for any reason.\r\n \r\nTerms & Conditions:\r\nWe are a family-run business and pride ourselves on offeringan enjoyable and comfortable stay for all our guests. Whether youre stayingwith us whilst working, travelling, on holiday or just stopping by, we offer afriendly and welcoming vibe and a home from home experience. To help usensure that all our guests  including you  enjoy their time here, we ask youto respect the following guidelines.  \r\nLets start with the basics \r\n* Rent is due in advance  so have your dollar ready tosecure your booking\r\n* Treat all staff & guests respectfully  no one likes adouchebag, so just be nice, okay?!\r\n* Our kitchen closes at 10pm  so get your food and midnightsnacks prepped and cooked before\r\n* Clean up your dishes & surfaces after cooking  wedont want the hangry feeling to kick in for the other guests because youhavent done your dishes! ($25 may apply if staff have to clean up your mess)\r\n* Label your food with your name & date of check out we like our fridges to be smelling sweet not sour, and so we do regular fridgeclean outs. \r\nThen theres a few no gos \r\n* Dont smoke inside the building ( were a home, not achimney and it is safety hazard)\r\n* Don't take any drugs on the property (that includesbaloons)\r\n* Dont drink alcohol after 10pm on the property (theresplenty of bars nearby)\r\n* Dont use or go in the backyard after 10pm (our neighboursdont like it)\r\n* Dont be loud or party after 10pm (some people have to beup in the mornings)\r\n* No visitors after 10pm, and dont let them in your room atany time (maybe go to their place) \r\nPs: The serious side note \r\nany behaviour which does notalign with these guidelines is subject to the owner/managers discretion andyou will be asked to leave ( so please dont be THAT GUEST okay! Simples!  \r\nBut the great news is \r\n* We have high speed free WiFi\r\n* Entertainment room with huge TV showing Netflix, YouTube and Kayo sports channels including free to air Australian channels.\r\n* Theres a huge backyard with tables, chairs and free BBQfor you to enjoyand yoga mats if youre feeling the need to zen  again, justkeep the area clean ($25 may apply if not) \r\nSo now thats done with \r\nenjoy your stay and let us know iftheres anything you need to make your stay more comfortable. \r\n\r\nPayment Policy\r\nWe do request full upfront payment before arrival to provideself check in option. \r\nAny payment due will need to pay in full before check in.","checkin":{"from":14,"until":22},"latestCheckout":"10:00","policies":["TAXESINCLUDED"],"cancellationPolicy":{"canxDays":1,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":80,"name":"FREECITYMAPS"},{"id":90,"name":"FREEWIFI"}]},{"name":"FACILITYCATEGORYGENERAL","id":2,"facilities":[{"id":28,"name":"BICYCLEPARKING"},{"id":113,"name":"JOBSBOARD"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":15,"name":"LUGGAGESTORAGE"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":79,"name":"BOOKEXCHANGE"},{"id":84,"name":"PLAYSTATION"},{"id":85,"name":"WII"},{"id":95,"name":"BOARDGAMES"},{"id":133,"name":"WIFI"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":29,"name":"BBQ"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":124,"name":"MICROWAVE"}]},{"name":"FACILITYCATEGORYLAUNDRY","id":8,"facilities":[{"id":102,"name":"DRYER"},{"id":122,"name":"IRONIRONINGBOARD"},{"id":131,"name":"WASHINGMACHINE"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"}]},{"name":"FACILITYCATEGORYOUTDOORS","id":10,"facilities":[{"id":107,"name":"OUTDOORTERRACE"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":14,"name":"LOCKERS"}]},{"name":"FACILITYCATEGORYSOCIALAREAS","id":12,"facilities":[{"id":24,"name":"COMMONROOM"},{"id":108,"name":"GAMESROOM"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":120,"name":"CEILINGFAN"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":13,"name":"TOWELSFORHIRE"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/erd5ceeihi7vqliii4d5","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/jltrjopwg6uuuzmlf2ei","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/xq2o4e4vzld1guc1jmic","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/cybrgsmozx2osuaewc1s","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/arb2r4gvzddsvkxqppsv","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/qf3lfwuvgrcdxvp5cunc","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/wj6ukvm5leh0uvgubd9o","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/fbkn0drd7snltr6pejiu","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/w8hbjpys1des8wutb2dq","position":9},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/316573/ffgqb5qo7vgriwqmwimj","position":10}],"videos":[],"video":null,"payments":{"payNow":false},"paymentMethods":["PayPal","AliPay","Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":3,"promotions":[],"categories":[]}
