{"type":"HOSTEL","name":"Sow and Piglets Guesthouse","nameEN":"Sow and Piglets Guesthouse","isActive":true,"isNew":false,"description":"Sow and Piglets Guesthouse is a modern, award winning guesthouse located in Port Campbell, almost at the end of the Great Ocean Road, only a 10-minute drive from the iconic Twelve Apostles and a 3-minute walk from the beach. With attached microbrewery and ever popular brewpub, we are the only guesthouse with a Brewery in Australia. \n\nThe guesthouse and brewery were created to give the Great Ocean Road traveller, a fun, friendly place that they can call home from homefor a night or two, and as we like to say in our hostel, one night is not enough! Whether you plan to explore Port Campbell and its surrounding areas, meet new travellers, or just take a break from your adventures, our friendly staff will make sure you have an awesome and comfortable stay.\n\nPlease note, we are working brewery with attached brewpub, where you can buy our award winning beer. We are very proud at what we do and being a licensed property, we strictly don't allow any alcohol from the outside to be brought or consumed on the premises, both in and out. You wouldn't bring your own beer into the pub either, would you? Please take this into consideration when planning your trip. \n\nReception opens at 4pm daily.\nLast check in at 8pm (Later in Summer period)\n\nPayment may be automatically taken 48 hours prior to check-in (for Non Refundable Bookings). Funds must be available in your account, otherwise you run the risk of your reservation being cancelled. Surcharges may apply for some Credit or Debit cards.\nCancellation policy of 2 days","hostelworldSays":null,"hostelSays":null,"location":{"address1":"18 Tregea St","address2":"Port Campbell","city":{"id":7646,"name":"Port Campbell","nameEN":"Port Campbell"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":38,"name":"Great Ocean Road","nameEN":"Great Ocean Road"},"latitude":"-38.6185188","longitude":"142.9951172","distance":{"kilometers":0.11,"miles":0.07}},"maxGuestsPerBooking":8,"depositPercentage":15,"ratings":{"security":93,"location":93,"staff":83,"atmosphere":83,"clean":95,"facilities":85,"value":85,"overall":88,"ratingsCount":1333},"groupInformation":null,"currency":"AUD","houseRules":{"notes":"Reception opens at 2pm daily.\r\nLast check in at 8pm (Later in Summer period)\r\n\r\nFull Payment will be taken from your cc 48 prior your arrival day. Funds must be available in your account, otherwise you run the risk of your reservation being cancelled. Surcharges may apply for some Credit or Debit cards.\r\nCancellation policy of 2 days\r\n\r\nINTRODUCTION. While we understand that most of this sort of official information is bland and boring, we also strongly recommend you take the time to read it before you hit the road... especially the House Rules (and FAQ's, if you'd like to pick up a little local knowledge). And while we believe that there's nothing within the Hostel's House Rules that are at all peculiar when it comes to the usual expectations of backpackers and independent travellers who frequent Hostels, if you've got any questions - please contact the Hostel directly.\r\n\r\nESTIMATING THE TIME IT TAKES TO DRIVE THE LENGTH OF THE GREAT OCEAN ROAD. Many guests underestimate the time it can take to drive westwards, on the Great Ocean Road (that is, if you are driving west, towards Port Campbell, on the GOR).  While the GOR is only a reasonably short driving distance on maps, there are dozens of natural attractions you may wish to stop and see along the way.  So, please consider that point as you plan your drive and, therefore, when you calculate your estimated Arrival Time.\r\n\r\nHOUSE RULE 1: CHECKING-IN. The Hostel's Reception opens at 2pm every day, and remains open until around 8pm (later in Summer).\r\n\r\nHOUSE RULE 2: CREDIT CARD FACILITIES. The Hostel accepts VISA and Mastercard credit cards, if you wish to settle your account using this method of payment.  Note that, all International card transactions will attract a surcharge of 2.5%, applied to the total cost of accommodation.\r\n\r\nHOUSE RULE 3: ISSUING OF KEY-CARDS. Hostel guests are issued with a key-card that permits access to their room and after-hours access into the Hostel.  \r\n\r\nHOUSE RULE 4: KITCHEN OPENING HOURS. We do not want want anybody to burn the Hostel down when cooking. So, for safety reasons, power to the Hostel's hard-wired cooking amenities (e.g. ovens, stove-tops) is automatically supplied from 2pm - 10pm, and in the morning from 6am - 10.30am when requested. Portable kitchen cooking amenities (e.g. toasters, kettles) can be used at all times.\r\n\r\nHOUSE RULE 8: CHECKING-OUT. Check-out from the Hostel is 10am sharp, unless you have made prior arrangements with the Hostel.\r\n\r\n(HOUSE RULE 9: HOSTEL CLOSED FOR CLEANING BETWEEN 10.30am - 2pm each day to everyone except guests who have paid to stay consecutive nights.\r\n\r\n(PCH) HOUSE RULE 10: NO SHOWS. The terms and conditions of your booking allow the Hostel to charge your credit card for the first nights accommodation if you're a no-show.\r\nIf you are not going to fill your booking, contact the Hostel directly to inform us of that, either by phone or email 24 hours prior your arrival. Otherwise, the Hostel will charge your credit card to the extent permitted by HostelWorld's terms and conditions relating to no-shows.\r\n\r\nFAQ 2: How reliable is cell (mobile) phone coverage? From experience, only Telstra provides consistent and reasonably reliable reception along the western end of the Great Ocean Road, and in Port Campbell (with Optus providing better coverage as time goes by).  Other phone network providers  for example, Vodafone, or the 3 network  normally offer poor reception at this end of the GOR. \r\n\r\nFAQ 3: Where can you buy groceries in Port Campbell?  At the small general store on the main street of Port Campbell.  It is normally open from around 7.30am-7.30pm, though its hours of operation vary depending upon demand.  While it carries a reasonably large range of products it does not carry as much stock as you would expect to find in a major supermarket.\r\n\r\nFAQ 4: Where can you buy fuel (aka: petrol, gas) in Port Campbell? There is a fuel station located in the village's main street.  It is open from 8.00am-8.00pm, 365 days of the year.\r\n\r\nFAQ 5: Are there any good walks around Port Campbell? Yes. The 'Discovery' walk, to the immediate west of the village, is a 4km round-trip (allow 1 hours) that is suitable for all fitness levels. It takes you along the cliff-face on top of Port Campbell Bay, offering exceptional views of the Southern Ocean and brilliant views east, along the coastline towards the 12 Apostles.  It's an excellent, short walk that, depending on the weather, can really highlight the power of the Southern Ocean!","checkin":{"from":14,"until":20},"latestCheckout":"10:00","policies":["TAXESINCLUDED"],"cancellationPolicy":{"canxDays":2,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":30,"name":"FREEPARKING"},{"id":90,"name":"FREEWIFI"},{"id":103,"name":"FREEINTERNETACCESS"}]},{"name":"FACILITYCATEGORYGENERAL","id":2,"facilities":[{"id":51,"name":"MEETINGROOM"},{"id":113,"name":"JOBSBOARD"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":116,"name":"PARKING"},{"id":153,"name":"RECEPTIONLIMITEDHOURS"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":4,"name":"INTERNETACCESS"},{"id":79,"name":"BOOKEXCHANGE"},{"id":95,"name":"BOARDGAMES"},{"id":133,"name":"WIFI"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":2,"name":"RESTAURANT"},{"id":12,"name":"BAR"},{"id":29,"name":"BBQ"},{"id":83,"name":"MEALSAVAILABLE"},{"id":125,"name":"TEACOFFEEMAKINGFACILITIES"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":92,"name":"KITCHEN"},{"id":100,"name":"FRIDGEFREEZER"},{"id":124,"name":"MICROWAVE"}]},{"name":"FACILITYCATEGORYACCESSIBILITY","id":7,"facilities":[{"id":8,"name":"WHEELCHAIRACCESSIBLE"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"}]},{"name":"FACILITYCATEGORYOUTDOORS","id":10,"facilities":[{"id":107,"name":"OUTDOORTERRACE"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":22,"name":"KEYCARDACCESS"},{"id":112,"name":"24HOURSECURITY"}]},{"name":"FACILITYCATEGORYSOCIALAREAS","id":12,"facilities":[{"id":24,"name":"COMMONROOM"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":119,"name":"HAIRDRYERS"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":7,"name":"BICYCLEHIRE"},{"id":13,"name":"TOWELSFORHIRE"},{"id":37,"name":"BREAKFASTNOTINCLUDED"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/23.jpg","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/26.jpg","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/btcbvsrd7p3hlwwhgfqc","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/lhqd2swfc7jh3mhrlvow","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/vskwgf9xwgamex1pnjco","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/lhwnhie5nthucgq32rjj","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/lgebjh5rdnlfxki3oyys","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/2/27275/mitvltndymd6abxni4iy","position":9}],"videos":[],"video":null,"payments":{"payNow":false},"paymentMethods":["Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":2,"promotions":[],"categories":[]}
