{"type":"HOTEL","name":"Aspect Central","nameEN":"Aspect Central","isActive":true,"isNew":false,"description":"!!!!!! Position, Position, Position !!!!!!\r\n\r\nWelcome to one of the Citys most exciting contemporary designed boutique motels.\r\n\r\nAspect Central is ideally located on the corner of Sheridan and Grove Streets Cairns.\r\n\r\nAspect Central is 800 metres north of the City CBD, 2 blocks from the Cairns Esplanade foreshore and a short 3km drive from both the Cairns Domestic and International Airport terminals.\r\n\r\nThe property is 100% non smoking and offers convenience, privacy and comfort with attention to superior customer service.\r\n\r\nAll guest rooms, conference facilities, restaurant and public areas at Aspect Central have access to the High Speed Wireless Broadband.\r\n\r\nThe property proves to be popular with all types of travellers from business clients, leisure guests, groups, tour organisations, government offices, families and alike.\r\n\r\nEach room has a modern and comfortable contemporary design that determines its own style and personality.\r\n\r\nFor business or leisure why not escape to the comfort of the tastefully appointed guest rooms which are furnished to a standard one would expect and equipped with many lifestyle and business facilities.\r\n\r\nOn offer is a range of guest rooms for families, groups, singles and couples, all suites have quality bed linen, premium guest amenities and are comfortably furnished with the necessary facilities required to ensure that all guests have a comfortable and restful stay.\r\n\r\nThe property has over 30 individual character suites. Each one of them has its own personality which has been created by the choice of furniture, layout and paint decoration.\r\n\r\nOnce inside, unique elements of the buildings design are evident throughout the property, which helps to establish an overall feeling of well-being and uniqueness.\r\n\r\nAll rooms have been restyled recently with imported ceramic tiles and common area tableware.\r\n\r\nWith the well equipped room facilities and the practical building layout ease of access and free movement is created.\r\n\r\nWith live wild orchids, ferns, fan palms and native flora adorning the suites, Aspect Central provides a much sought after ambience and comfort one would expect.\r\n\r\nThe unique reef style pool was designed and built by master craftsman. Every tile, shell, coral rock feature and cascading waterfall displays were hand made and meticulously placed piece by piece in position to create an absolute breathtaking focal point of the property.\r\n\r\nThe outdoor salt water reef style swimming pool creates a feeling of adventure and realism similar to the outer reef itself but on a much smaller scale. With coral, large clam, crab shells and many other reef ornaments tastefully on display around the poolside a fun and relaxing reef experience is assured.\r\n\r\nMost Tour operators pick up and drop off from the property daily and you will save a genuine 5% on all of your tour bookings when made at Aspect Centrals on site tour desk.\r\n\r\nAspect Centrals on site food and beverage outlets are fully serviced by a well renowned team of award winning experts.\r\n\r\nThe restaurant is open 7 days a week for Breakfast, Lunch and Dinner and offers a myriad of first class dining options from local fresh seafood choices to innovative local and international meals.\r\n\r\nThe restaurant delivers authentic alfresco dining experiences with an emphasis on Western fusion specialties. Whilst the restaurant offers semi formal dining, the Caf and Alfresco section is in a bright relaxed casual setting by the reef style pool.\r\n\r\nThe lunchtime cafe provides selections of dining favourites that have truly stood the test of time. For family and business dining, the restaurant provides just the right atmosphere which is created by the design aspects of the building, together with the tastefully positioned furnishings and decorative finishes.\r\n\r\nFor those that are on the go, lets not forget the fast moving take away and sit down smorgasbord of choices, which are located just across from Aspect Central on the eatery strip.","hostelworldSays":null,"hostelSays":null,"location":{"address1":"209 Sheridan Street","address2":"","city":{"id":154,"name":"Cairns","nameEN":"Cairns"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":76,"name":"Queensland","nameEN":"Queensland"},"latitude":"-16.9140433","longitude":"145.7650475","distance":{"kilometers":1.66,"miles":1.03}},"maxGuestsPerBooking":8,"depositPercentage":15,"ratings":{"security":0,"location":0,"staff":0,"atmosphere":0,"clean":0,"facilities":0,"value":0,"overall":0,"ratingsCount":0},"groupInformation":null,"currency":"AUD","houseRules":{"notes":null,"checkin":{"from":0,"until":23},"latestCheckout":"10:00","policies":["NOCURFEW","TAXESINCLUDED"],"cancellationPolicy":{"canxDays":1,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":16,"name":"SWIMMINGPOOL"},{"id":118,"name":"OUTDOORSWIMMINGPOOL"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/1.jpg","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/2.jpg","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/3.jpg","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/4.jpg","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/5.jpg","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/6.jpg","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/7.jpg","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/32084/8.jpg","position":8}],"videos":[],"video":null,"payments":{"payNow":false},"paymentMethods":["Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":0,"promotions":[],"categories":[]}
