{"type":"HOSTEL","name":"Bayside House","nameEN":"Bayside House","isActive":true,"isNew":false,"description":"Welcome to Bayside House, the ultimate hostel experience in the heart of St Kilda. With 113 beds across 20 rooms, including private rooms, mixed and girl-only dorms, Bayside House caters to all types of travellers.\r\n\r\nOur facilities include:\r\n- 13 showers and 14 toilets, ensuring you never have to wait long for a hot shower or a clean bathroom.\r\n- Cozy and comfortable common areas, including a spacious lounge with comfortable couches, a flat-screen TV, and a selection of books and board games.\r\n- A fully-equipped kitchen, where you can whip up a delicious meal and enjoy it with fellow travelers in our dining area.\r\n- A range of private rooms and dormitories, each thoughtfully designed to provide you with a comfortable and peaceful night's sleep. \r\n- Our beds are fitted with high-quality linens and plush pillows, ensuring you wake up feeling refreshed and ready to explore all that St Kilda has to offer.\r\n\r\nOur prime location puts you:\r\n- Just a 5-minute walk from the iconic St Kilda Beach, where you can soak up the sun, swim in the refreshing waters of Port Phillip Bay, or enjoy a stroll along the boardwalk.\r\n- A stone's throw away from Luna Park, attracting thousands of backpackers and locals every week with its famous roller coaster and other thrilling rides.\r\n- Just a doorstep away from the St Kilda junction tram stop, providing easy access to the famed nightlife of St Kilda and beyond.\r\n- Within a moment's walk from Fitzroy and Acland St, teeming with cafes, restaurants, bars, and shops.\r\n\r\nAnd with Melbourne's famous events and festivals all at your fingertips, you'll never be short of things to do. Some of the events and attractions nearby include:\r\n- The FREE St Kilda Festival and Midsumma Pride March, just minutes away.\r\n- The Australian Open tennis, just 4.1km away at Rod Laver Arena.\r\n- The MCG, 4km away.\r\n- A short tram ride to Albert Park, where the Australian Grand Prix is hosted.\r\n\r\nWith so much to see and do, Bayside House is the perfect base for exploring all that St Kilda and Melbourne have to offer.","hostelworldSays":null,"hostelSays":null,"location":{"address1":"14/16 Punt Rd, St Kilda","address2":"","city":{"id":21,"name":"Melbourne","nameEN":"Melbourne"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":78,"name":"Victoria","nameEN":"Victoria"},"latitude":"-37.8560197","longitude":"144.9834073","distance":{"kilometers":4.97,"miles":3.09}},"maxGuestsPerBooking":8,"depositPercentage":15,"ratings":{"security":87,"location":87,"staff":73,"atmosphere":73,"clean":67,"facilities":73,"value":80,"overall":77,"ratingsCount":73},"groupInformation":{"listingInfo":"","terms":"","cancellationTerms":"Property and Cancellation Polices:\r\nFull Charge - Full Deposit - If cancelled within 48 hours of arrival","additionalTerms":"House Rules:\r\nTo ensure the best experience during your stay, please read and agree to the following House Rules:\r\n\r\n1.      NO SMOKING OR VAPING IN HOSTEL OR HOSTEL ENTRANCE = IMMEDIATE EVICTION.  Alarms will sound and you will be issued a $10,000 AUD fine for fire services.\r\n2.      If fire hydrants are set off you will be issued a $2,500 fine for fire services.\r\n3.      Australian citizens must provide a valid credit card and accept a pre-authorisation / bond  of $100 AUD.\r\n4.      Booking payments to be paid in advance before check in. Visitors must pay $10 for facilities. Non-guests can come into the common room ONLY with permission from receptionists. If they are your friends you are   responsible for them. If you sneak non-guests into the rooms you will be evicted with no refund.\r\n5.      Visitors are not allowed inside dorm rooms. Visitors must leave the Hostel by 11:30pm.\r\n6.      Personal belongings to be always kept tidy, items to be on your bed or underneath.\r\n7.      Cleaners onsite daily, however it is your responsibility to keep your belongings neat and tidy.\r\n8.      Security – Lockers in the communal kitchen (you need to provide your own lock), ensure you lock away your personal items. CCTV onsite for security.\r\n9.      I agree to have my photo taken and held in line with my booking.\r\n10.   Reception is open from 8am - 4pm 7 days a week. A contact number is available at reception for EMERGENCIES ONLY outside of these times.\r\n11.   NO bikes are to be kept within the Hostel. ALL bikes, e-bikes and motorbikes are to be stored outside and it is the responsibility of the guest.\r\n12.   Emergency plan – Hostel tour to be provided upon check-in – please follow announcement instructions if sounded (refer to emergency plans throughout hostel)\r\n13.   Sleep in YOUR DORM ROOM and ALLOCATED BED – no sleeping in common areas.\r\n14.   Guests to use facilities and common areas on the ground floor and the floor of their dorm ONLY.\r\n15.   Theft from the hostel and or other guests = IMMEDIATE EVICTION.\r\n16.   Vandalism / breaking things at the hostel = IMMEDIATE EVICTION.\r\n17.   No booking = no bed (i.e. bed swapping / squatting) = IMMEDIATE EVICTION.\r\n18.   Violence / fighting / aggressive behaviour = IMMEDIATE EVICTION.\r\n19.   Drugs or drug utensils found at hostel = IMMEDIATE EVICTION.\r\n20.   Dealing of drugs at hostel = IMMEDIATE EVICTION & POLICE REPORT.\r\n21.   Sexual assault = IMMEDIATE EVICTION & POLICE REPORT.\r\n22.   No cooking after 10pm. Turn on fan when cooking.\r\n23.   No rolling of cigarettes on hostel premises. \r\n24.   No using electrical / personal grooming (Includes hair strainers, hair dryers etc) outside in the bed rooms ALL equipment must be used in the bathrooms.","typesNotAccepted":["JUNIORPRIMARYSCHOOL"],"remainderDue":"ONARR","ageRangesAccepted":["12-18","18-21","21-35","35-50","50+"],"maxGuestsPerBooking":80},"currency":"AUD","houseRules":{"notes":"2. BOOKINGS\r\n\r\n2.2 When requesting Bookings, Customers will be required to provide identification information including, but not limited to, their name, address, contact telephone number, email address and valid credit card details. An international Passport and Drivers License will be required to verify your identity at check in.\r\n2.4 Subject to clause 4 the Hostel will use its reasonable endeavours to accommodate any request from the Customer to change the Booking Details but any request to change the dates or length of stay or add products and/or services will be subject to availability and the Customer paying for such increased length of stay and/or products and/or services at the Hostels standard rates from time to time.\r\n2.5 When booking multiple beds in a shared room, the Hostel will make a genuine attempt to put people on the same booking in the same room, however this cannot be guaranteed, we will endeavour to do our best.\r\n\r\n3. FEES AND PAYMENT\r\n3.1 The Charges will be as quoted by the Hostel to the Customer upon the Customers request for a Booking.\r\n3.2 Unless otherwise agreed by the Hostel, the Charges only cover the provision of accommodation at the Hostel and the Customer may incur additional charges including, without limitation, charges for towels, room service and other services (the Additional Charges).\r\n3.3 Customers will be informed of the amount of the Additional Charges before they are incurred.\r\n3.4 By making a booking the customer agrees to an automatic payment of the Charges in full 48 hours prior to the arrival date. At time of booking the customer must provide valid Credit Card details to secure the booking.\r\n3.5 Any Additional Charges must be paid either as they are incurred or, at the Hostels option, upon the Customer checking out at the Hostel.\r\n3.6 The Hostel reserves the right to pre-authorize credit cards for group booking or for all Bookings over peak periods without any written approval from the customer.\r\n3.7 The following payment methods are accepted by the Hostel; Cash or Credit Card. \r\n3.8 Payment fees are automatically charged when processing your payments. Credit card surcharge / payment fees are non-refundable and / or transferable.\r\n3.9 All Visa cards will incur a 2.19% payment fee.\r\n3.10 All Mastercard cards will incur a 2.18% payment fee.\r\n3.11 We reserve the right to change payment fees as they fluctuate with our merchant.\r\n\r\n4. CANCELLATIONS & REFUNDS\r\n4.1 If you have booked a room through the use of a travel agency or an online travel agency, you must cancel or modify your booking through the agency that you used to make the booking. \r\n4.2 The Customer may cancel the Booking without charge if notice is given to the Hostel at least 48 hours prior to 1400 hours (local time) on the Arrival Date. In which case the Hostel will refund to the Customer all sums paid by the Customer in advance\r\n4.3 Where the Customer fails to give sufficient notice of cancellation as per clause 4.1 or fails to arrive (no show) at the Hostel, the entire Booking will be deemed cancelled and the already pre-charged or applicable rate amount due will apply\r\n4.4 The Hostel may at any time cancel a Booking if the Hostel becomes unavailable due to circumstances outside the Hostels control in which case the Hostel will pay the Customer a full refund of any Charges and any booking fee paid\r\n4.5 The Hostel may cancel the Booking if the payment details provided by the Customer are invalid or insufficient. The Hostel will make all reasonable attempts to contact the Customer for alternative valid details\r\n\r\n5. CHECK IN AND CHECK OUT\r\n5.1 Check-in time at the Hostel booked is from 1400 hrs. Check-in prior to 1400 hrs. may be available subject to availability. Guests will be given a link when completing our online check-in and our systems will notify them when their room / bed is ready. Guests may access communal facilities prior to check-in if required\r\n5.2 Check-out time at the Hostel booked is 1000 hrs. Later check-out times may be possible by prior arrangement with an additional charge and subject to availability. (In the absence of such prior arrangement, failure to check-out by 1000 hrs may result in the Customer being charged for an additional nights accommodation at the standard applicable rate\r\n\r\n6. HOSTEL RULES\r\n6.1 Valid photo identification in the form of a Driver License or Passport is required at check-in\r\n6.2 Customers are required to conduct themselves and ensure that their Guests conduct themselves in a reasonable and responsible manner at the Hostel and must not act in any way which may disturb other guests. Failure to adhere to this requirement may result in Guests being asked to leave the Hostel in which event all Charges and Additional Charges shall become immediately payable by the Guest\r\n6.3 Smoking and vaping is not permitted at any time inside the Hostel \r\n6.4 The Customer will be responsible for any loss or damage caused at the Hostel by Guests or visitor of the Guest. The Guest may be liable for the Hostels reasonable cost of repairing, cleaning or replacing any property of the Hostel which is damaged, soiled or lost by a Guest\r\n6.5 No animals are allowed in the Hostel with the exception of guide dogs and our own animals\r\n6.6 The Hostel does not accept bookings made by those under the age of 18. Under 18s cannot stay in any shared rooms with other guests that are not part of the family or group, however they can stay in private rooms when accompanied by an adult over 18 years. Failure to adhere to this rule will result in automatic Cancellation with no refund given\r\n6.7 Tampering with any fire protection device in or around the property including but not limited to fire detectors, fire sprinklers, fire hoses, extinguishers & fire doors will result in fines and / or damages. The use of any device to prevent guest room doors from closing are prohibited\r\n6.8 Guests responsible for fire alarm activation will be responsible for the fines applied by the local Fire Department plus any additional costs and losses Bayside House incur, unless an actual fire emergency has occurred. Note, these alarms can be set off by things such as but not limited to hair dryers, hair straighteners, aerosol cans, steam from showers and tampering of alarms\r\n\r\n7. FOOD AND DRINK\r\n7.1 Unless otherwise agreed by the Hostel, the Charges do not include any food or drink.\r\n7.2 Customers and their Guests may not consume or store food and drinks (other than water or items place by the hostel within the room) in their rooms. Alcohol may not be consumed in any room at any time.\r\n\r\n8. DISABLED GUESTS\r\n8.1 The Hostel complies with all laws regulating the treatment of, and provision for, disabled Guests\r\n8.2 Customers with any special requirements pertaining to a disability should inform the management team at the Hostel prior to the Arrival Date\r\n8.3 Wheelchair access - Please check the hostel information or contact the individual hostel directly before making a booking\r\n\r\n9. PRIVACY DETAILS\r\n9.1 The Hostel collects and handles your personal information in accordance with our Privacy Policy, so that we can provide and administer our products and services including travel products, processing bookings, payments, check-ins and cancellations and provide you information about these. Without your information, we may not be able to provide you products and services and you may miss out on receiving valuable information from us. If you are located outside of Australia, please be aware that any information you provide to us, will be transferred from your country of origin to Australia and you consent to this transfer. We may disclose your personal information to third party operators of travel deals you have booked, to sponsors and partners when you enter a competition or promotion, when you become a member and to third party service providers. These third parties may have servers located overseas such as in the USA and UK and you consent to these disclosures. If you are providing information on behalf of someone else, you confirm that you have authority to do so, and you have given them the information set out in our Privacy Policy and they have not objected to our handling, use and disclosure of their personal information. You have a right to access your personal information that we hold and may ask us to update, correct or delete this. Our (ADD LINK TO OUR PRIVACY POLICY) contains more details on your rights and contact details for questions or complaints.","checkin":{"from":14,"until":20},"latestCheckout":"10:00","policies":["TAXESINCLUDED"],"cancellationPolicy":{"canxDays":2,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":90,"name":"FREEWIFI"},{"id":103,"name":"FREEINTERNETACCESS"},{"id":350,"name":"FREESECURITYLOCKERS"}]},{"name":"FACILITYCATEGORYGENERAL","id":2,"facilities":[{"id":113,"name":"JOBSBOARD"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":15,"name":"LUGGAGESTORAGE"},{"id":104,"name":"POSTALSERVICE"},{"id":153,"name":"RECEPTIONLIMITEDHOURS"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":4,"name":"INTERNETACCESS"},{"id":95,"name":"BOARDGAMES"},{"id":106,"name":"CABLETV"},{"id":109,"name":"POOLTABLE"},{"id":133,"name":"WIFI"},{"id":386,"name":"SMARTTV"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":86,"name":"VENDINGMACHINES"},{"id":125,"name":"TEACOFFEEMAKINGFACILITIES"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":92,"name":"KITCHEN"},{"id":99,"name":"COOKER"},{"id":100,"name":"FRIDGEFREEZER"},{"id":101,"name":"UTENSILS"},{"id":124,"name":"MICROWAVE"},{"id":359,"name":"KETTLE"},{"id":360,"name":"POTSANDPANS"},{"id":361,"name":"SINK"},{"id":362,"name":"STOVE"},{"id":363,"name":"TOASTER"}]},{"name":"FACILITYCATEGORYACCESSIBILITY","id":7,"facilities":[{"id":364,"name":"RAMPS"}]},{"name":"FACILITYCATEGORYLAUNDRY","id":8,"facilities":[{"id":5,"name":"LAUNDRYFACILITIES"},{"id":102,"name":"DRYER"},{"id":131,"name":"WASHINGMACHINE"},{"id":368,"name":"FREEIRONIRONINGBOARD"},{"id":369,"name":"RECYCLINGBINS"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":22,"name":"KEYCARDACCESS"},{"id":112,"name":"24HOURSECURITY"},{"id":375,"name":"CCTVINCOMMONAREAS"},{"id":376,"name":"FIREEXTINGUISHERS"},{"id":377,"name":"FIRSTAIDKITS"},{"id":378,"name":"SMOKEALARMS"},{"id":379,"name":"SMOKEDETECTOR"}]},{"name":"FACILITYCATEGORYSOCIALAREAS","id":12,"facilities":[{"id":24,"name":"COMMONROOM"},{"id":108,"name":"GAMESROOM"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":50,"name":"AIRCONDITIONING"},{"id":382,"name":"CHARGINGPLUGS"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":13,"name":"TOWELSFORHIRE"},{"id":37,"name":"BREAKFASTNOTINCLUDED"},{"id":150,"name":"EXPRESSCHECKINOUT"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/hu3g99e8efa0pxwuzky3","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/spbri66bip8iq7yj7jp6","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/takqafuqiydzy4cfnoxu","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/i6uiwvg6dbwzc8b77kxv","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/hsx2rmod2v4fnazx4cxj","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/fdlyxzgmwpi3qczsm8jt","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/abeeupg6w67bn8ehpg5h","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/jptn7v2jjp1djbpf9tgj","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/bznr6ki4wtfggiqslwuy","position":9},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/snrapsbwzlieuyr0hcop","position":10},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/xodjhftpa3mblnhwzui6","position":11},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/ke6nggggvdr0ry5vpusl","position":12},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/csy6kkcoack38vvwjqtw","position":13},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/odmgc1fbtzpw4miwl2mb","position":14},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/313555/hzq5zma0kdpekcji4qrk","position":15}],"videos":[],"video":null,"payments":{"payNow":false},"paymentMethods":["Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":2,"promotions":[{"id":141772,"type":"MOBILE","stack":true,"name":"MOBILEPROMOTION","created":"2023-06-28T06:35:39","isActive":true,"conditions":{"stayDates":{"isTotalNightsGreaterOrEqualThan":2},"propertyIds":{"containsAnyOf":[313555]},"ratePlanTypes":{"containsAnyStringOf":["Standard","NRR","Standard_BB","NRR_BB"]},"channel":{"isOneStringOf":["APPS","HW_MOBILE"]}},"benefits":{"PERCENTDISCOUNT":{"value":10}}},{"id":62771,"type":"LOS","stack":false,"name":"LENGTHOFSTAY","created":"2022-04-29T03:02:42","isActive":true,"conditions":{"stayDates":{"isTotalNightsGreaterOrEqualThan":7},"propertyIds":{"containsAnyOf":[313555]},"ratePlanTypes":{"containsAnyStringOf":["Standard_BB","Standard"]}},"benefits":{"PERCENTDISCOUNT":{"value":5}}},{"id":239279,"type":"CUSTOM","stack":false,"name":"ALLPLATFORMS","created":"2025-08-28T01:58:13","isActive":true,"conditions":{"stayDates":{"isTotalNightsGreaterOrEqualThan":2},"propertyIds":{"containsAnyOf":[313555]},"ratePlanTypes":{"containsAnyStringOf":["Standard","NRR","Standard_BB","NRR_BB"]},"roomTypeIds":{"containsAnyOf":[903988,903987,903991,903992,925008,880471]}},"benefits":{"PERCENTDISCOUNT":{"value":10}}}],"categories":[{"group_category_id":"STAIRCASE_TO_SUSTAINABILITY","group_category_type":"sustainability","group_category_title":"Staircase to Sustainability","group_category_description":"STAIRCASE_TO_SUSTAINABILITY_DESCRIPTION","categories":[{"category_title":"Sustainability Level 1","category_description":"This hostel has begun to introduce practices that result in a positive social and environmental impact, grasping the fundamentals of the Staircase to Sustainability.","category_image":"","category_id":"SUSTAINABILITY_TIER_1","lastModified":"2024-01-18T10:14:14.035Z"}],"multiple_categories":false}]}
