{"type":"APARTMENT","name":"Grosvenor 3121 Richmond","nameEN":"Grosvenor 3121 Richmond","isActive":true,"isNew":false,"description":"Close to everything in Melbourne: Walk / Tram / Train to CBD, MCG, Rod Lavor, Richmond and more!\r\nEnjoy all that Melbourne has to offer from this perfect location on edge of Melbourne’s CBD!\r\nLocated in the inner suburb of Richmond, Grosvenor 3121 offers the perfect location to enjoy a concert, tennis, cricket, the AFL, or a weekend away to explore all that Melbourne has to offer.\r\n\r\nWith a combination of different sized and configured apartments, choose the one that’s perfect for you.  Blending the latest entertainment offerings on Sony LED TV’s, as well as coffee machine’s, high speed internet, individual air conditioning, hydronic heating and electronic building access to provide both ease and comfort.  \r\nFREE : High Speed internet access and Netflix, Stan, Disney+, Paramount Plus, Binge, Kayo Sport, Prime, Flash News access included with your stay. \r\n\r\nEasy Access - Location, location, location!!!\r\n\r\nRESERVATION POLICY\r\nYour reservation is guaranteed until the day of arrival. After that time, it will no longer be guaranteed and the room may be reassigned. We will charge your credit card on the day we have confirmed your reservation.\r\nOn booking you will receive a link to complete ID verification.  This must be completed to confirm you reservation and match the details of the lead guest. \r\nThe property has the right to cancel your reservation if we do not receive the Pre-Payment Deposit or ID verification. We will send you a cancellation confirmation via email immediately after cancelling your booking.  You must be over the age of 18 to book. \r\nThe maximum occupancy for all apartments is two guests (2 adults or 1 adult and 1 child).  There is no capacity for additional guests.   \r\n\r\nCHECK-IN POLICY\r\nOur check in time is from 2pm and check out is 10am.\r\n\r\nCHECK IN REQUIREMENTS:             \r\nProperty registration and check in is available only to guests who are not prohibited from entering the property, are 18 years of age or over, and are recorded on the reservation at the time of booking. A valid form of photo identification acceptable must be loaded into the self-check-in system and a selfie supplied in order to process your check-in a copy of which will be recorded.\r\nAcceptable photographic Identification Documents:\r\n•\ta valid and current Australian state or territory or New Zealand driver’s licence; \r\n•\ta valid and current Australian or foreign passport; \r\n•\ta valid and current Australian state or territory or New Zealand learner’s permit; \r\n•\ta valid and current Australian state or territory Photo Card or Proof of Age card; or \r\n•\ta valid and current Australian ImmiCard.\r\nOnce self-check-in has been completed digital access will be provided.  Acceptable photographic Identification Documents must be available for review during your stay.\r\n\r\nPAYMENT SECURITY:\r\nAll reservations must be guaranteed with a valid credit card at time of booking. This does not constitute payment. Payment in full is required for all accommodation prior to check in (if not prepaid in advance). Prepayment of accommodation will only be accepted three full days or more prior to check in date. \r\n\r\nTo secure your reservation, a deposit of the first nights’ accommodation will be deducted within 48 hours of you make your reservation with the remaining fee payable prior to arrival.  Payments by credit card incur a 1.75% service fee.  For non-refundable books full payment will be taken at time of booking. \r\n\r\nIf your booking has a cancellation period, your deposit will be refunded to your nominated credit card. Cancellations within 7 days of check-in will result in forfeiture of the full fee payable for the stay and you consent to your payment method be charged at the time of cancellation for the remaining balance owing.  \r\n\r\nAn additional credit card pre-authorisation, debit card or EFTPOS payment of $200 per apartment is required as security for any incidental costs, including damage associated with the room. Cash is not accepted. Please note, a service fee of 1.75% applies to all credit card transactions. Alternatively, payments can be made up to ten business days prior to arrival via cheque or bank deposit. Please enquire for further information.\r\n\r\nEXTENDING YOUR STAY  \r\nAfter you have booked your stay with us, you can extend your stay (depending on availability) by simply letting us know before you arrive. \r\n\r\nIf you are already staying with us and you would like to stay longer, please let us know at least 24 hours before your check- out date. We will do our best to accommodate your new plans and this can include relocating you to a similar apartment should this be necessary.\r\n\r\nImportant When you make a reservation, you are booking an apartment type (not a specific apartment). Each apartment type includes similar apartments of similar size and equipment, however, interior design can be different.  Reservations can only be taken and confirmed by making an advance payment of first nights price or the full rental amount. This can be paid using debit and credit cards or bank transfer. \r\n\r\nWe will process your booking within 24 hours of receiving your request. Please note, your booking has not been made or verified until you receive a confirmation email from support@mystaymail.com\r\n\r\nCANCELLATION POLICY\r\nStandard Rate \r\nPlease carefully read our cancellation policy. Rarely can we make any exceptions to this.. So to save any misunderstanding we would be grateful if you can observe the following:\r\n•\tIf the guest cancels more than 60 days in advance, the total amount of the reservation will be refunded. \r\n•\tIf the guest cancels less than 60 days in advance, the 30% prepayment is non-refundable. \r\n•\tIf the guest arrives and decides to leave early, the nights not spent 24 hours after the cancellation occurs are 50% refunded.\r\n•\tIn case of a no-show, the total price of the reservation will be charged and is non- refundable.\r\n•\tThere is only one way in which we can acknowledge cancellation of the guest’s reservation; the guest must send a cancellation request stating the reservation number via email to the following address: support@mystaymail.com or initiate a cancellation via the link provided on booking. \r\n•\tAll cancellations are confirmed via email immediately after the reservation has been cancelled. \r\nNon-Refundable Rate\r\nThe total price of the reservation will be charged on booking and is non-refundable. \r\n\r\nDAMAGES:\r\nAll guests are personally liable for all charges made by any person to the room account (regardless of whether such charges are made during the property stay or expressly authorised by the guest who is recorded on the reservation) and for any damage to the room and associated property facilities caused by the guest or any person using the room and associated property facilities with the consent of the guest.An additional cash, EFTPOS or debit card payment of $200 or credit card imprint will also be required as security for any incidental costs, including damage associated with the room.If full payment of the account is not received, all guests agree to My Stay Melbourne deducting any outstanding balance from the credit or debit card provided.\r\n\r\nREFUNDS / RELEASES\r\nCash refunds will only be returned to the guest who supplied the photo identification upon check in. Card refunds generally take between 3-10 working days to process, and pre-authorisation releases take up to 31 days to process, depending on the individual bank policies.Please note that a more detailed inspection of the apartment is usually made after the check-out time and we reserve the right to make charges for any damages or breakages found before the apartment is occupied again.\r\n\r\nNON-SMOKING POLICY\r\nPlease note that this is non-smoking property, and that any form of smoking (including electronic cigarettes) in will result in a $500 cleaning fee and any additional costs associated with emergency services attending the property.\r\n\r\nACCEPTABLE BEHAVIOUR\r\nIllegal, disorderly or offensive behaviour (including but not limited to (i) aggressive behaviour or threatening language towards our staff or other guests; (ii) clothing with offensive designs/words; (iii) any person who is a member of an illegal gang and/or is displaying extensive or excessive head and/or facial tattoos that could be considered offensive, threatening or divisive; or (iv) disturbance to our staff or guests of My Stay Melbourne including excessive noise or music) is strictly prohibited and My Stay Melbourne may direct you and/or any member of your party to leave immediately if your conduct results in Security attendance or is considered by us to be inappropriate; likely to cause harm; or impair the enjoyment, comfort or safety of anyone; or is likely, in our belief, to breach any of this agreement. No refunds or compensation will be given in these circumstances and My Stay Melbourne reserves the right not to accept any future bookings from you or any member of your party.\r\n\r\nKITCHEN ROOM POLICY\r\nPlease practice safe cooking habits do not leave burners on unattended. Please do not cook with strong smelling ingredients. Lingering smells that require room closure and deep cleans will be charged a cleaning fee of up to $500.\r\n\r\nROOM CLEANING POLICY\r\nRoom refreshes will not be offered during stays. Should you need fresh towels or linen, please email support@mystaymail.com or message +61 411 328 366.\r\n\r\nGUEST SAFETY POLICY\r\nAs part of our commitment to guest safety, employees will not disclose the identity, room number or presence of a guest to anyone other than appropriate law enforcement. This includes the taking of or delivery of messages. It is the responsibility of guests to communicate their presence and apartment number to any person they wish to receive calls or visits from. Safety cameras are used throughout the premises, and anyone on our property may be recorded. The hotel assumes no responsibility for any personal bodily injury incurred while using facilities, where available. If you use the BBQ, garden or laundry facilities, you do so at your own risk.\r\n\r\nBBQ & GUEST LAUNDRY\r\nA BBQ are and guest laundry are available for use by in-house guests.  Persons not staying at the property are not permitted to use these facilities.  All facilities are to be left clean after using and damage is to be report by email support@mystaymail.com or message +61 411 328 366.  You agree to any damage or cleaning costs being charged to the credit card on file.  \r\n\r\nPARKING\r\nWe do not offer parking, however secure paid overnight parking is available at 35 Elizabeth Street, Richmond which is 450m /6min walk from the accommodation. There is also some limited free after-hours street parking on New Street.  There is unrestricted parking just outside the Elizabeth Street parking garage (advertised as an alternative to street parking but open only between 6 am and 10 pm only during the week)Parking around the area immediate area is a mixture of permitted and times parking. We recommend that you check signage as the local council's parking inspectors are active at all time of the day and evenings.\r\n\r\nHOTEL EVENTS\r\nFrom time-to-time access to areas of the property will be restricted during events.  These include, but are not limited to, the garden, BBQ and Guest Laundry Area.  \r\n\r\nADDITIONAL INFORMATION:\r\nRequests for an early check-in or late check-out will be subject to availability and will not be guaranteed, unless the room is reserved for the night prior to arrival, which will incur an additional night's charge.Requests for late departures are subject to availability on check-out, however, can also be guaranteed if booked prior to arrival at an additional fee.We are unable to store luggage past check-out.Whilst we will do our utmost to provide you with the room of your choice, please be aware that any room preferences including floor or view cannot be guaranteed.All MyStay Rewards members' discount rates are subject to change according to your current membership level at the time of your check in.We look forward to welcoming you to the Grosvenor 3121 Richmond a My Stay Melbourne Property.  \r\n\r\nPRIVACY POLICY\r\nInformation We Collect \r\nPersonal Information: We may collect personally identifiable information such as your name, email address, phone number, and other contact details when you voluntarily provide them through forms on our website. Non-Personal Information: We may collect non-personal information, such as browser type, IP address, and usage patterns when you visit our website. This information helps us improve our website and services. \r\n\r\nUse of Information \r\nPersonal Information: We may use your personal information to respond to your inquiries, provide you with requested services, and send you promotional materials or updates if you have opted in to receive them. Non-Personal Information: Non-personal information may be used for analytical and statistical purposes to enhance your experience on our website. Cookies and Tracking We use cookies and similar tracking technologies to collect information about your browsing behavior on our website. You can manage your cookie preferences through your browser settings. \r\n\r\nThird-Party Links \r\nOur website may contain links to third-party websites. We are not responsible for the content or privacy practices of these websites. Please review their privacy policies before providing any personal information. \r\n\r\nSecurity\r\nWe implement reasonable security measures to protect your personal information. However, no method of transmission over the internet or electronic storage is completely secure. \r\n\r\nYour Rights\r\nYou have the right to access, correct, or delete your personal information. To exercise these rights, please contact us using the provided contact information. \r\n\r\nChanges to Privacy Policy\r\nWe may update this privacy policy from time to time. The latest version will be posted on this page, and the date of the most recent update will be indicated at the top of the policy. \r\n\r\nContact Us\r\nIf you have any questions or concerns regarding this privacy policy or the use of your personal information, please contact us at support@mystaymail.com \r\n\r\nAcceptance of Terms \r\nBy using our website / booking with us, you agree to the terms and conditions outlined in this privacy policy. \r\n\r\nLIABILITY\r\n Victoria Australian Consumer Law and Fair Trading Act 2012 Part 5.2 of the Australian Consumer Law and Fair Trading Act 2012 may make an accommodation provider liable to make good the loss of a guest’s property in certain circumstances even though the loss is not caused by the fault of the accommodation provider, or the provider’s agent.  \r\nThe liability of the accommodation provider under the Act— \r\n•       applies only to a guest of the accommodation provider; \r\n•       applies only for the period for which the guest is provided accommodation; \r\n•       is limited to $300 for each room provided for the use of the guest on the day, unless the guest’s property was placed in a safekeeping service;\r\n •       is limited to $3000 for each room in respect of a guest’s property that was placed in a safekeeping service (excluding a safe in a room); \r\n•       does not cover motor vehicles and property owned by the guest left in or on a motor vehicle.  \r\n\r\nPart 5.2 does not limit any other right or remedy available under the Australian Consumer Law and Fair Trading Act 2012.  \r\n\r\nJURISDICTION \r\nThese Terms are governed by the laws of Victoria, Australia and each party irrevocably submits to the non-exclusive jurisdiction of the courts of Victoria, Australia. If any part or any provision of these Terms is held or found to be void, invalid or otherwise unenforceable it will be deemed to be severed to the extent that it is void or to the extent of voidability, invalidity or unenforceability, but the remainder of that part or provision, and these Terms will remain in full force and effect.","hostelworldSays":null,"hostelSays":null,"location":{"address1":"113 Hoddle Street","address2":"Richmond","city":{"id":21,"name":"Melbourne","nameEN":"Melbourne"},"country":{"id":13,"name":"Australia","nameEN":"Australia"},"region":{"id":78,"name":"Victoria","nameEN":"Victoria"},"latitude":"-37.8137130","longitude":"144.9909210","distance":{"kilometers":2.44,"miles":1.51}},"maxGuestsPerBooking":8,"depositPercentage":15,"ratings":{"security":0,"location":0,"staff":0,"atmosphere":0,"clean":0,"facilities":0,"value":0,"overall":0,"ratingsCount":0},"groupInformation":null,"currency":"AUD","houseRules":{"notes":"RESERVATION POLICY\r\nYour reservation is guaranteed until the day of arrival. After that time, it will no longer be guaranteed and the room may be reassigned. We will charge your credit card on the day we have confirmed your reservation.\r\nOn booking you will receive a link to complete ID verification.  This must be completed to confirm you reservation and match the details of the lead guest. \r\nThe property has the right to cancel your reservation if we do not receive the Pre-Payment Deposit or ID verification. We will send you a cancellation confirmation via email immediately after cancelling your booking.  You must be over the age of 18 to book. \r\nThe maximum occupancy for all apartments is two guests (2 adults or 1 adult and 1 child).  There is no capacity for additional guests.   \r\n\r\nCHECK-IN POLICY\r\nOur check in time is from 2pm and check out is 10am.\r\n\r\nCHECK IN REQUIREMENTS:             \r\nProperty registration and check in is available only to guests who are not prohibited from entering the property, are 18 years of age or over, and are recorded on the reservation at the time of booking. A valid form of photo identification acceptable must be loaded into the self-check-in system and a selfie supplied in order to process your check-in a copy of which will be recorded.\r\nAcceptable photographic Identification Documents:\r\n•\ta valid and current Australian state or territory or New Zealand driver’s licence; \r\n•\ta valid and current Australian or foreign passport; \r\n•\ta valid and current Australian state or territory or New Zealand learner’s permit; \r\n•\ta valid and current Australian state or territory Photo Card or Proof of Age card; or \r\n•\ta valid and current Australian ImmiCard.\r\nOnce self-check-in has been completed digital access will be provided.  Acceptable photographic Identification Documents must be available for review during your stay.\r\n\r\nPAYMENT SECURITY:\r\nAll reservations must be guaranteed with a valid credit card at time of booking. This does not constitute payment. Payment in full is required for all accommodation prior to check in (if not prepaid in advance). Prepayment of accommodation will only be accepted three full days or more prior to check in date. \r\n\r\nTo secure your reservation, a deposit of the first nights’ accommodation will be deducted within 48 hours of you make your reservation with the remaining fee payable prior to arrival.  Payments by credit card incur a 1.75% service fee.  For non-refundable books full payment will be taken at time of booking. \r\n\r\nIf your booking has a cancellation period, your deposit will be refunded to your nominated credit card. Cancellations within 7 days of check-in will result in forfeiture of the full fee payable for the stay and you consent to your payment method be charged at the time of cancellation for the remaining balance owing.  \r\n\r\nAn additional credit card pre-authorisation, debit card or EFTPOS payment of $200 per apartment is required as security for any incidental costs, including damage associated with the room. Cash is not accepted. Please note, a service fee of 1.75% applies to all credit card transactions. Alternatively, payments can be made up to ten business days prior to arrival via cheque or bank deposit. Please enquire for further information.\r\n\r\nEXTENDING YOUR STAY  \r\nAfter you have booked your stay with us, you can extend your stay (depending on availability) by simply letting us know before you arrive. \r\n\r\nIf you are already staying with us and you would like to stay longer, please let us know at least 24 hours before your check- out date. We will do our best to accommodate your new plans and this can include relocating you to a similar apartment should this be necessary.\r\n\r\nImportant When you make a reservation, you are booking an apartment type (not a specific apartment). Each apartment type includes similar apartments of similar size and equipment, however, interior design can be different.  Reservations can only be taken and confirmed by making an advance payment of first nights price or the full rental amount. This can be paid using debit and credit cards or bank transfer. \r\n\r\nWe will process your booking within 24 hours of receiving your request. Please note, your booking has not been made or verified until you receive a confirmation email from support@mystaymail.com\r\n\r\nCANCELLATION POLICY\r\nStandard Rate \r\nPlease carefully read our cancellation policy. Rarely can we make any exceptions to this.. So to save any misunderstanding we would be grateful if you can observe the following:\r\n•\tIf the guest cancels more than 60 days in advance, the total amount of the reservation will be refunded. \r\n•\tIf the guest cancels less than 60 days in advance, the 30% prepayment is non-refundable. \r\n•\tIf the guest arrives and decides to leave early, the nights not spent 24 hours after the cancellation occurs are 50% refunded.\r\n•\tIn case of a no-show, the total price of the reservation will be charged and is non- refundable.\r\n•\tThere is only one way in which we can acknowledge cancellation of the guest’s reservation; the guest must send a cancellation request stating the reservation number via email to the following address: support@mystaymail.com or initiate a cancellation via the link provided on booking. \r\n•\tAll cancellations are confirmed via email immediately after the reservation has been cancelled. \r\nNon-Refundable Rate\r\nThe total price of the reservation will be charged on booking and is non-refundable. \r\n\r\nDAMAGES:\r\nAll guests are personally liable for all charges made by any person to the room account (regardless of whether such charges are made during the property stay or expressly authorised by the guest who is recorded on the reservation) and for any damage to the room and associated property facilities caused by the guest or any person using the room and associated property facilities with the consent of the guest.An additional cash, EFTPOS or debit card payment of $200 or credit card imprint will also be required as security for any incidental costs, including damage associated with the room.If full payment of the account is not received, all guests agree to My Stay Melbourne deducting any outstanding balance from the credit or debit card provided.\r\n\r\nREFUNDS / RELEASES\r\nCash refunds will only be returned to the guest who supplied the photo identification upon check in. Card refunds generally take between 3-10 working days to process, and pre-authorisation releases take up to 31 days to process, depending on the individual bank policies.Please note that a more detailed inspection of the apartment is usually made after the check-out time and we reserve the right to make charges for any damages or breakages found before the apartment is occupied again.\r\n\r\nNON-SMOKING POLICY\r\nPlease note that this is non-smoking property, and that any form of smoking (including electronic cigarettes) in will result in a $500 cleaning fee and any additional costs associated with emergency services attending the property.\r\n\r\nACCEPTABLE BEHAVIOUR\r\nIllegal, disorderly or offensive behaviour (including but not limited to (i) aggressive behaviour or threatening language towards our staff or other guests; (ii) clothing with offensive designs/words; (iii) any person who is a member of an illegal gang and/or is displaying extensive or excessive head and/or facial tattoos that could be considered offensive, threatening or divisive; or (iv) disturbance to our staff or guests of My Stay Melbourne including excessive noise or music) is strictly prohibited and My Stay Melbourne may direct you and/or any member of your party to leave immediately if your conduct results in Security attendance or is considered by us to be inappropriate; likely to cause harm; or impair the enjoyment, comfort or safety of anyone; or is likely, in our belief, to breach any of this agreement. No refunds or compensation will be given in these circumstances and My Stay Melbourne reserves the right not to accept any future bookings from you or any member of your party.\r\n\r\nKITCHEN ROOM POLICY\r\nPlease practice safe cooking habits do not leave burners on unattended. Please do not cook with strong smelling ingredients. Lingering smells that require room closure and deep cleans will be charged a cleaning fee of up to $500.\r\n\r\nROOM CLEANING POLICY\r\nRoom refreshes will not be offered during stays. Should you need fresh towels or linen, please email support@mystaymail.com or message +61 411 328 366.\r\n\r\nGUEST SAFETY POLICY\r\nAs part of our commitment to guest safety, employees will not disclose the identity, room number or presence of a guest to anyone other than appropriate law enforcement. This includes the taking of or delivery of messages. It is the responsibility of guests to communicate their presence and apartment number to any person they wish to receive calls or visits from. Safety cameras are used throughout the premises, and anyone on our property may be recorded. The hotel assumes no responsibility for any personal bodily injury incurred while using facilities, where available. If you use the BBQ, garden or laundry facilities, you do so at your own risk.\r\n\r\nBBQ & GUEST LAUNDRY\r\nA BBQ are and guest laundry are available for use by in-house guests.  Persons not staying at the property are not permitted to use these facilities.  All facilities are to be left clean after using and damage is to be report by email support@mystaymail.com or message +61 411 328 366.  You agree to any damage or cleaning costs being charged to the credit card on file.  \r\n\r\nPARKING\r\nWe do not offer parking, however secure paid overnight parking is available at 35 Elizabeth Street, Richmond which is 450m /6min walk from the accommodation. There is also some limited free after-hours street parking on New Street.  There is unrestricted parking just outside the Elizabeth Street parking garage (advertised as an alternative to street parking but open only between 6 am and 10 pm only during the week)Parking around the area immediate area is a mixture of permitted and times parking. We recommend that you check signage as the local council's parking inspectors are active at all time of the day and evenings.\r\n\r\nHOTEL EVENTS\r\nFrom time-to-time access to areas of the property will be restricted during events.  These include, but are not limited to, the garden, BBQ and Guest Laundry Area.  \r\n\r\nADDITIONAL INFORMATION:\r\nRequests for an early check-in or late check-out will be subject to availability and will not be guaranteed, unless the room is reserved for the night prior to arrival, which will incur an additional night's charge.Requests for late departures are subject to availability on check-out, however, can also be guaranteed if booked prior to arrival at an additional fee.We are unable to store luggage past check-out.Whilst we will do our utmost to provide you with the room of your choice, please be aware that any room preferences including floor or view cannot be guaranteed.All MyStay Rewards members' discount rates are subject to change according to your current membership level at the time of your check in.We look forward to welcoming you to the Grosvenor 3121 Richmond a My Stay Melbourne Property.  \r\n\r\nPRIVACY POLICY\r\nInformation We Collect \r\nPersonal Information: We may collect personally identifiable information such as your name, email address, phone number, and other contact details when you voluntarily provide them through forms on our website. Non-Personal Information: We may collect non-personal information, such as browser type, IP address, and usage patterns when you visit our website. This information helps us improve our website and services. \r\n\r\nUse of Information \r\nPersonal Information: We may use your personal information to respond to your inquiries, provide you with requested services, and send you promotional materials or updates if you have opted in to receive them. Non-Personal Information: Non-personal information may be used for analytical and statistical purposes to enhance your experience on our website. Cookies and Tracking We use cookies and similar tracking technologies to collect information about your browsing behavior on our website. You can manage your cookie preferences through your browser settings. \r\n\r\nThird-Party Links \r\nOur website may contain links to third-party websites. We are not responsible for the content or privacy practices of these websites. Please review their privacy policies before providing any personal information. \r\n\r\nSecurity\r\nWe implement reasonable security measures to protect your personal information. However, no method of transmission over the internet or electronic storage is completely secure. \r\n\r\nYour Rights\r\nYou have the right to access, correct, or delete your personal information. To exercise these rights, please contact us using the provided contact information. \r\n\r\nChanges to Privacy Policy\r\nWe may update this privacy policy from time to time. The latest version will be posted on this page, and the date of the most recent update will be indicated at the top of the policy. \r\n\r\nContact Us\r\nIf you have any questions or concerns regarding this privacy policy or the use of your personal information, please contact us at support@mystaymail.com \r\n\r\nAcceptance of Terms \r\nBy using our website / booking with us, you agree to the terms and conditions outlined in this privacy policy. \r\n\r\nLIABILITY\r\n Victoria Australian Consumer Law and Fair Trading Act 2012 Part 5.2 of the Australian Consumer Law and Fair Trading Act 2012 may make an accommodation provider liable to make good the loss of a guest’s property in certain circumstances even though the loss is not caused by the fault of the accommodation provider, or the provider’s agent.  \r\nThe liability of the accommodation provider under the Act— \r\n•       applies only to a guest of the accommodation provider; \r\n•       applies only for the period for which the guest is provided accommodation; \r\n•       is limited to $300 for each room provided for the use of the guest on the day, unless the guest’s property was placed in a safekeeping service;\r\n •       is limited to $3000 for each room in respect of a guest’s property that was placed in a safekeeping service (excluding a safe in a room); \r\n•       does not cover motor vehicles and property owned by the guest left in or on a motor vehicle.  \r\n\r\nPart 5.2 does not limit any other right or remedy available under the Australian Consumer Law and Fair Trading Act 2012.  \r\n\r\nJURISDICTION \r\nThese Terms are governed by the laws of Victoria, Australia and each party irrevocably submits to the non-exclusive jurisdiction of the courts of Victoria, Australia. If any part or any provision of these Terms is held or found to be void, invalid or otherwise unenforceable it will be deemed to be severed to the extent that it is void or to the extent of voidability, invalidity or unenforceability, but the remainder of that part or provision, and these Terms will remain in full force and effect.","checkin":{"from":14,"until":24},"latestCheckout":"10:00","policies":["TAXESINCLUDED"],"cancellationPolicy":{"canxDays":0,"freeCancellationEnabled":true}},"taxes":[],"hoscars":{"awards":[],"nominations":[]},"facilities":[{"name":"FACILITYCATEGORYFREE","id":1,"facilities":[{"id":90,"name":"FREEWIFI"}]},{"name":"FACILITYCATEGORYSERVICES","id":3,"facilities":[{"id":116,"name":"PARKING"}]},{"name":"FACILITYCATEGORYENTERTAINMENT","id":5,"facilities":[{"id":133,"name":"WIFI"},{"id":386,"name":"SMARTTV"}]},{"name":"FACILITYCATEGORYFOODANDDRINKS","id":4,"facilities":[{"id":29,"name":"BBQ"},{"id":125,"name":"TEACOFFEEMAKINGFACILITIES"},{"id":358,"name":"MINIBAR"}]},{"name":"FACILITYCATEGORYKITCHEN","id":6,"facilities":[{"id":92,"name":"KITCHEN"},{"id":98,"name":"DISHWASHER"},{"id":99,"name":"COOKER"},{"id":100,"name":"FRIDGEFREEZER"},{"id":101,"name":"UTENSILS"},{"id":124,"name":"MICROWAVE"},{"id":359,"name":"KETTLE"},{"id":360,"name":"POTSANDPANS"},{"id":361,"name":"SINK"},{"id":362,"name":"STOVE"},{"id":363,"name":"TOASTER"}]},{"name":"FACILITYCATEGORYLAUNDRY","id":8,"facilities":[{"id":5,"name":"LAUNDRYFACILITIES"},{"id":102,"name":"DRYER"},{"id":122,"name":"IRONIRONINGBOARD"},{"id":131,"name":"WASHINGMACHINE"},{"id":368,"name":"FREEIRONIRONINGBOARD"},{"id":369,"name":"RECYCLINGBINS"}]},{"name":"FACILITYCATEGORYWELLNESS","id":9,"facilities":[{"id":81,"name":"HOTSHOWERS"}]},{"name":"FACILITYCATEGORYOUTDOORS","id":10,"facilities":[{"id":370,"name":"GARDEN"}]},{"name":"FACILITYCATEGORYSAFETYANDSECURITY","id":11,"facilities":[{"id":375,"name":"CCTVINCOMMONAREAS"},{"id":376,"name":"FIREEXTINGUISHERS"},{"id":377,"name":"FIRSTAIDKITS"},{"id":378,"name":"SMOKEALARMS"},{"id":379,"name":"SMOKEDETECTOR"}]},{"name":"FACILITYCATEGORYBEDROOM","id":13,"facilities":[{"id":9,"name":"LINENINCLUDED"},{"id":50,"name":"AIRCONDITIONING"},{"id":87,"name":"TOWELSINCLUDED"},{"id":119,"name":"HAIRDRYERS"},{"id":120,"name":"CEILINGFAN"}]},{"name":"FACILITYCATEGORYAVAILABLEFORAFEE","id":15,"facilities":[{"id":152,"name":"LATECHECKOUT"},{"id":352,"name":"PAIDPARKING"}]}],"images":[{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/gqdnjfhit8col3jbqom5","position":1},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/aey76iyuyfmerzx4mwzx","position":2},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/aox17f6u6vhlyso13vph","position":3},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/lufatjtnu1c1wbkocztd","position":4},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/nmp9uiniv1pudhlxhvwk","position":5},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/b3pslzsakixluznmjt8o","position":6},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/zxtzjfu97w78qmxchext","position":7},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/s4yqz7ugqezk4d07loub","position":8},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/ssbxgdhh2cg2gaylkxst","position":9},{"prefix":"a.hwstatic.com/image/upload/f_auto,q_auto","suffix":"/v1/propertyimages/3/328845/cdgn0qteswt14mdvaikf","position":10}],"videos":[],"video":null,"payments":{"payNow":false},"paymentMethods":["PayPal","AliPay","Visa","Mastercard","VisaDebit","Electron","Maestro","JCB"],"hostelworldRecommends":false,"isElevateProperty":false,"hasExperiences":false,"timesBookedToday":0,"promotions":[{"id":203875,"type":"LOS","stack":false,"name":"LENGTHOFSTAY","created":"2024-10-17T13:09:16","isActive":true,"conditions":{"stayDates":{"isDaysToArrivalMoreOrEqualThan":2,"isTotalNightsGreaterOrEqualThan":3},"propertyIds":{"containsAnyOf":[328845]},"ratePlanTypes":{"containsAnyStringOf":["Standard","Standard_BB"]}},"benefits":{"PERCENTDISCOUNT":{"value":15}}},{"id":203873,"type":"LASTMINUTE","stack":false,"name":"LASTMINUTE","created":"2024-10-17T13:09:15","isActive":true,"conditions":{"stayDates":{"isDaysToArrivalLessOrEqualThan":2,"isTotalNightsGreaterOrEqualThan":1},"propertyIds":{"containsAnyOf":[328845]},"ratePlanTypes":{"containsAnyStringOf":["Standard","NRR","Standard_BB","NRR_BB"]}},"benefits":{"PERCENTDISCOUNT":{"value":20}}},{"id":223012,"type":"APPS","stack":true,"name":"App-only deal","created":"2025-04-14T06:47:32","isActive":true,"conditions":{"stayDates":{"isAfterOrSameDayThan":"2025-04-14","isBeforeOrSameDayThan":"2025-05-31","isDaysToArrivalMoreOrEqualThan":2,"isTotalNightsGreaterOrEqualThan":7},"propertyIds":{"containsAnyOf":[328845]},"ratePlanTypes":{"containsAnyStringOf":["Standard","NRR","Standard_BB","NRR_BB"]},"channel":{"isOneStringOf":["APPS"]}},"benefits":{"PERCENTDISCOUNT":{"value":22}}},{"id":204972,"type":"APPS","stack":true,"name":"App-only deal","created":"2024-10-30T07:22:29","isActive":true,"conditions":{"stayDates":{"isDaysToArrivalMoreOrEqualThan":3,"isTotalNightsGreaterOrEqualThan":2},"propertyIds":{"containsAnyOf":[328845]},"ratePlanTypes":{"containsAnyStringOf":["Standard","NRR","Standard_BB","NRR_BB"]},"channel":{"isOneStringOf":["APPS"]}},"benefits":{"PERCENTDISCOUNT":{"value":10}}}],"categories":[]}
